ranjithaguna/pv/LED_Demo/source/pic32cx/component/pcr.h
/**
 * \brief Component description for PIC32CX/0525SG12 PCR
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_PCR_COMPONENT_H_
#define _PIC32CX_0525SG12_PCR_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_PCR The Power, Clocks, and Resets (PCR) Section identifies all the power supplies,\n        clock sources, and reset inputs to the chip and defines all the derived power, clock, and reset signals.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PCR */
/* ========================================================================== */

/* -------- PCR_SYS_SLP_CNTRL : (PCR Offset: 0x00) (R/W 32) System Sleep Control -------- */

typedef union
{
  struct
  {
    uint32_t SLEEP_MODE:1;              /**< bit:      0  Selects the System Sleep mode                 */
    uint32_t :1;                        /**< bit:      1  Reserved                                      */
    uint32_t TEST:1;                    /**< bit:      2  Test bit                                      */
    uint32_t SLEEP_ALL:1;               /**< bit:      3  Initiates the System Sleep mode               */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_SYS_SLP_CNTRL_bits_t;
#define PCR_SYS_SLP_CNTRL_RESETVALUE        (0x00U)                                       /**<  (PCR_SYS_SLP_CNTRL) System Sleep Control  Reset Value */

#define PCR_SYS_SLP_CNTRL_SLEEP_MODE_Pos      (0)                                            /**< (PCR_SYS_SLP_CNTRL) Selects the System Sleep mode Position */
#define PCR_SYS_SLP_CNTRL_SLEEP_MODE_Msk      (0x1U << PCR_SYS_SLP_CNTRL_SLEEP_MODE_Pos)     /**< (PCR_SYS_SLP_CNTRL) Selects the System Sleep mode Mask */
#define PCR_SYS_SLP_CNTRL_TEST_Pos            (2)                                            /**< (PCR_SYS_SLP_CNTRL) Test bit Position */
#define PCR_SYS_SLP_CNTRL_TEST_Msk            (0x1U << PCR_SYS_SLP_CNTRL_TEST_Pos)           /**< (PCR_SYS_SLP_CNTRL) Test bit Mask */
#define PCR_SYS_SLP_CNTRL_SLEEP_ALL_Pos       (3)                                            /**< (PCR_SYS_SLP_CNTRL) Initiates the System Sleep mode Position */
#define PCR_SYS_SLP_CNTRL_SLEEP_ALL_Msk       (0x1U << PCR_SYS_SLP_CNTRL_SLEEP_ALL_Pos)      /**< (PCR_SYS_SLP_CNTRL) Initiates the System Sleep mode Mask */
#define PCR_SYS_SLP_CNTRL_Msk                 (0x0000000DUL)                                 /**< (PCR_SYS_SLP_CNTRL) Register Mask  */

/* -------- PCR_PROC_CLK_CNTRL : (PCR Offset: 0x04) (R/W 32) Processor Clock Control Register [7:0] Processor Clock Divide Value (PROC_DIV)\n            1: divide 48 MHz Ring Oscillator by 1.\n            3: divide 48 MHz Ring Oscillator by 3.\n            4: divide 48 MHz Ring Oscillator by 4.\n            16: divide 48 MHz Ring Oscillator by 16.\n            48: divide 48 MHz Ring Oscillator by 48.\n            No other values are supported. -------- */

typedef union
{
  struct
  {
    uint32_t PROCESSOR_CLOCK_DIVIDE:8;  /**< bit:   0..7  Selects the EC clock rate                     */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_PROC_CLK_CNTRL_bits_t;
#define PCR_PROC_CLK_CNTRL_RESETVALUE       (0x04U)                                       /**<  (PCR_PROC_CLK_CNTRL) Processor Clock Control Register [7:0] Processor Clock Divide Value (PROC_DIV)\n            1: divide 48 MHz Ring Oscillator by 1.\n            3: divide 48 MHz Ring Oscillator by 3.\n            4: divide 48 MHz Ring Oscillator by 4.\n            16: divide 48 MHz Ring Oscillator by 16.\n            48: divide 48 MHz Ring Oscillator by 48.\n            No other values are supported.  Reset Value */

#define PCR_PROC_CLK_CNTRL_PROCESSOR_CLOCK_DIVIDE_Pos (0)                                            /**< (PCR_PROC_CLK_CNTRL) Selects the EC clock rate Position */
#define PCR_PROC_CLK_CNTRL_PROCESSOR_CLOCK_DIVIDE_Msk (0xFFU << PCR_PROC_CLK_CNTRL_PROCESSOR_CLOCK_DIVIDE_Pos)  /**< (PCR_PROC_CLK_CNTRL) Selects the EC clock rate Mask */
#define PCR_PROC_CLK_CNTRL_PROCESSOR_CLOCK_DIVIDE(value) (PCR_PROC_CLK_CNTRL_PROCESSOR_CLOCK_DIVIDE_Msk & ((value) << PCR_PROC_CLK_CNTRL_PROCESSOR_CLOCK_DIVIDE_Pos))
#define PCR_PROC_CLK_CNTRL_Msk                (0x000000FFUL)                                 /**< (PCR_PROC_CLK_CNTRL) Register Mask  */

/* -------- PCR_SLOW_CLK_CNTRL : (PCR Offset: 0x08) (R/W 32) Configures the EC_CLK clock domain -------- */

typedef union
{
  struct
  {
    uint32_t SLOW_CLOCK_DIVIDE:10;      /**< bit:   0..9  SLOW_CLOCK_DIVIDE. n=Divide by n; 0=Clock off */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_SLOW_CLK_CNTRL_bits_t;
#define PCR_SLOW_CLK_CNTRL_RESETVALUE       (0x1E0U)                                      /**<  (PCR_SLOW_CLK_CNTRL) Configures the EC_CLK clock domain  Reset Value */

#define PCR_SLOW_CLK_CNTRL_SLOW_CLOCK_DIVIDE_Pos (0)                                            /**< (PCR_SLOW_CLK_CNTRL) SLOW_CLOCK_DIVIDE. n=Divide by n; 0=Clock off Position */
#define PCR_SLOW_CLK_CNTRL_SLOW_CLOCK_DIVIDE_Msk (0x3FFU << PCR_SLOW_CLK_CNTRL_SLOW_CLOCK_DIVIDE_Pos)  /**< (PCR_SLOW_CLK_CNTRL) SLOW_CLOCK_DIVIDE. n=Divide by n; 0=Clock off Mask */
#define PCR_SLOW_CLK_CNTRL_SLOW_CLOCK_DIVIDE(value) (PCR_SLOW_CLK_CNTRL_SLOW_CLOCK_DIVIDE_Msk & ((value) << PCR_SLOW_CLK_CNTRL_SLOW_CLOCK_DIVIDE_Pos))
#define PCR_SLOW_CLK_CNTRL_Msk                (0x000003FFUL)                                 /**< (PCR_SLOW_CLK_CNTRL) Register Mask  */

/* -------- PCR_OSC_ID : (PCR Offset: 0x0c) (R/W 32) Oscillator ID Register -------- */

typedef union
{
  struct
  {
    uint32_t TEST:8;                    /**< bit:   0..7  Test bits                                     */
    uint32_t PLL_LOCK:1;                /**< bit:      8  PLL Lock Status                               */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_OSC_ID_bits_t;
#define PCR_OSC_ID_RESETVALUE               (0x00U)                                       /**<  (PCR_OSC_ID) Oscillator ID Register  Reset Value */

#define PCR_OSC_ID_TEST_Pos                   (0)                                            /**< (PCR_OSC_ID) Test bits Position */
#define PCR_OSC_ID_TEST_Msk                   (0xFFU << PCR_OSC_ID_TEST_Pos)                 /**< (PCR_OSC_ID) Test bits Mask */
#define PCR_OSC_ID_TEST(value)                (PCR_OSC_ID_TEST_Msk & ((value) << PCR_OSC_ID_TEST_Pos))
#define PCR_OSC_ID_PLL_LOCK_Pos               (8)                                            /**< (PCR_OSC_ID) PLL Lock Status Position */
#define PCR_OSC_ID_PLL_LOCK_Msk               (0x1U << PCR_OSC_ID_PLL_LOCK_Pos)              /**< (PCR_OSC_ID) PLL Lock Status Mask */
#define PCR_OSC_ID_Msk                        (0x000001FFUL)                                 /**< (PCR_OSC_ID) Register Mask  */

/* -------- PCR_PWR_RST_STS : (PCR Offset: 0x10) (R/W 32) PCR Power Reset Status Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t VCC_PWRGD_STATUS:1;        /**< bit:      2  Indicates the status of VCC_PWRGD. 0 = PWRGD not asserted. 1 = PWRGD asserte. */
    uint32_t RESET_HOST_STATUS:1;       /**< bit:      3  Indicates the status of RESET_VCC. 0 = reset active. 1 = reset not active. */
    uint32_t RESET_VTR_STATUS:1;        /**< bit:      4  Indicates the status of RESET_VTR. 0 = reset active. 1 = reset not active.(R/W1C) */
    uint32_t VBAT_RESET_STATUS:1;       /**< bit:      5  VBAT reset status 0 = No reset occurred while VTR was off or since the last time this bit was cleared. 1 = A reset occurred.(R/WC) */
    uint32_t RESET_SYS_STATUS:1;        /**< bit:      6  Indicates the status of RESET_SYS.(R/W1C)\n                0 = No reset occurred since the last time this bit was cleared.\n                1 = A reset occurred. */
    uint32_t JTAG_RESET_STATUS:1;       /**< bit:      7  Indicates status of JTAG_TRST# pin.\n                0 = No JTAG reset occurred since the last time this bit was cleared.\n                1 = A reset occurred because of a JTAG command. */
    uint32_t WDT_EVENT:1;               /**< bit:      8  Indicates that a WDT_EVENT happened. (R/W1C)\n                0 = Not active.\n                1 = A WDT_EVENT occured. */
    uint32_t :1;                        /**< bit:      9  Reserved                                      */
    uint32_t _32K_ACTIVE:1;             /**< bit:     10  32K_ACTIVE (32K_ACTIVE)                       */
    uint32_t PCICLK_ACTIVE:1;           /**< bit:     11  PCICLK_ACTIVE (PCICLK_ACTIVE)                 */
    uint32_t ESPI_CLK_ACTIVE:1;         /**< bit:     12  ESPI_CLK_ACTIVE                               */
    uint32_t :19;                       /**< bit: 13..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_PWR_RST_STS_bits_t;
#define PCR_PWR_RST_STS_RESETVALUE          (0x00U)                                       /**<  (PCR_PWR_RST_STS) PCR Power Reset Status Register  Reset Value */

#define PCR_PWR_RST_STS_VCC_PWRGD_STATUS_Pos  (2)                                            /**< (PCR_PWR_RST_STS) Indicates the status of VCC_PWRGD. 0 = PWRGD not asserted. 1 = PWRGD asserte. Position */
#define PCR_PWR_RST_STS_VCC_PWRGD_STATUS_Msk  (0x1U << PCR_PWR_RST_STS_VCC_PWRGD_STATUS_Pos)  /**< (PCR_PWR_RST_STS) Indicates the status of VCC_PWRGD. 0 = PWRGD not asserted. 1 = PWRGD asserte. Mask */
#define PCR_PWR_RST_STS_RESET_HOST_STATUS_Pos (3)                                            /**< (PCR_PWR_RST_STS) Indicates the status of RESET_VCC. 0 = reset active. 1 = reset not active. Position */
#define PCR_PWR_RST_STS_RESET_HOST_STATUS_Msk (0x1U << PCR_PWR_RST_STS_RESET_HOST_STATUS_Pos)  /**< (PCR_PWR_RST_STS) Indicates the status of RESET_VCC. 0 = reset active. 1 = reset not active. Mask */
#define PCR_PWR_RST_STS_RESET_VTR_STATUS_Pos  (4)                                            /**< (PCR_PWR_RST_STS) Indicates the status of RESET_VTR. 0 = reset active. 1 = reset not active.(R/W1C) Position */
#define PCR_PWR_RST_STS_RESET_VTR_STATUS_Msk  (0x1U << PCR_PWR_RST_STS_RESET_VTR_STATUS_Pos)  /**< (PCR_PWR_RST_STS) Indicates the status of RESET_VTR. 0 = reset active. 1 = reset not active.(R/W1C) Mask */
#define PCR_PWR_RST_STS_VBAT_RESET_STATUS_Pos (5)                                            /**< (PCR_PWR_RST_STS) VBAT reset status 0 = No reset occurred while VTR was off or since the last time this bit was cleared. 1 = A reset occurred.(R/WC) Position */
#define PCR_PWR_RST_STS_VBAT_RESET_STATUS_Msk (0x1U << PCR_PWR_RST_STS_VBAT_RESET_STATUS_Pos)  /**< (PCR_PWR_RST_STS) VBAT reset status 0 = No reset occurred while VTR was off or since the last time this bit was cleared. 1 = A reset occurred.(R/WC) Mask */
#define PCR_PWR_RST_STS_RESET_SYS_STATUS_Pos  (6)                                            /**< (PCR_PWR_RST_STS) Indicates the status of RESET_SYS.(R/W1C)\n                0 = No reset occurred since the last time this bit was cleared.\n                1 = A reset occurred. Position */
#define PCR_PWR_RST_STS_RESET_SYS_STATUS_Msk  (0x1U << PCR_PWR_RST_STS_RESET_SYS_STATUS_Pos)  /**< (PCR_PWR_RST_STS) Indicates the status of RESET_SYS.(R/W1C)\n                0 = No reset occurred since the last time this bit was cleared.\n                1 = A reset occurred. Mask */
#define PCR_PWR_RST_STS_JTAG_RESET_STATUS_Pos (7)                                            /**< (PCR_PWR_RST_STS) Indicates status of JTAG_TRST# pin.\n                0 = No JTAG reset occurred since the last time this bit was cleared.\n                1 = A reset occurred because of a JTAG command. Position */
#define PCR_PWR_RST_STS_JTAG_RESET_STATUS_Msk (0x1U << PCR_PWR_RST_STS_JTAG_RESET_STATUS_Pos)  /**< (PCR_PWR_RST_STS) Indicates status of JTAG_TRST# pin.\n                0 = No JTAG reset occurred since the last time this bit was cleared.\n                1 = A reset occurred because of a JTAG command. Mask */
#define PCR_PWR_RST_STS_WDT_EVENT_Pos         (8)                                            /**< (PCR_PWR_RST_STS) Indicates that a WDT_EVENT happened. (R/W1C)\n                0 = Not active.\n                1 = A WDT_EVENT occured. Position */
#define PCR_PWR_RST_STS_WDT_EVENT_Msk         (0x1U << PCR_PWR_RST_STS_WDT_EVENT_Pos)        /**< (PCR_PWR_RST_STS) Indicates that a WDT_EVENT happened. (R/W1C)\n                0 = Not active.\n                1 = A WDT_EVENT occured. Mask */
#define PCR_PWR_RST_STS__32K_ACTIVE_Pos       (10)                                           /**< (PCR_PWR_RST_STS) 32K_ACTIVE (32K_ACTIVE) Position */
#define PCR_PWR_RST_STS__32K_ACTIVE_Msk       (0x1U << PCR_PWR_RST_STS__32K_ACTIVE_Pos)      /**< (PCR_PWR_RST_STS) 32K_ACTIVE (32K_ACTIVE) Mask */
#define PCR_PWR_RST_STS_PCICLK_ACTIVE_Pos     (11)                                           /**< (PCR_PWR_RST_STS) PCICLK_ACTIVE (PCICLK_ACTIVE) Position */
#define PCR_PWR_RST_STS_PCICLK_ACTIVE_Msk     (0x1U << PCR_PWR_RST_STS_PCICLK_ACTIVE_Pos)    /**< (PCR_PWR_RST_STS) PCICLK_ACTIVE (PCICLK_ACTIVE) Mask */
#define PCR_PWR_RST_STS_ESPI_CLK_ACTIVE_Pos   (12)                                           /**< (PCR_PWR_RST_STS) ESPI_CLK_ACTIVE Position */
#define PCR_PWR_RST_STS_ESPI_CLK_ACTIVE_Msk   (0x1U << PCR_PWR_RST_STS_ESPI_CLK_ACTIVE_Pos)  /**< (PCR_PWR_RST_STS) ESPI_CLK_ACTIVE Mask */
#define PCR_PWR_RST_STS_Msk                   (0x00001DFCUL)                                 /**< (PCR_PWR_RST_STS) Register Mask  */

