ranjithaguna/pv/LED_Demo/source/pic32cx/component/pcr.h
/* -------- PCR_PWR_RST_CNTRL : (PCR Offset: 0x14) (R/W 32) Power Reset Control Register -------- */

typedef union
{
  struct
  {
    uint32_t PWR_INV:1;                 /**< bit:      0  Used by FW to control internal RESET_VCC signal function and external PWROK pin. This bit is read-only when VCC_PWRGD\n      is de-asserted low. */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t HOST_RESET_SELECT:1;       /**< bit:      8  Determines what generates the internal platform reset signal. 1=LRESET# pin; 0=eSPI PLTRST# VWire */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_PWR_RST_CNTRL_bits_t;
#define PCR_PWR_RST_CNTRL_RESETVALUE        (0x101U)                                      /**<  (PCR_PWR_RST_CNTRL) Power Reset Control Register  Reset Value */

#define PCR_PWR_RST_CNTRL_PWR_INV_Pos         (0)                                            /**< (PCR_PWR_RST_CNTRL) Used by FW to control internal RESET_VCC signal function and external PWROK pin. This bit is read-only when VCC_PWRGD\n      is de-asserted low. Position */
#define PCR_PWR_RST_CNTRL_PWR_INV_Msk         (0x1U << PCR_PWR_RST_CNTRL_PWR_INV_Pos)        /**< (PCR_PWR_RST_CNTRL) Used by FW to control internal RESET_VCC signal function and external PWROK pin. This bit is read-only when VCC_PWRGD\n      is de-asserted low. Mask */
#define PCR_PWR_RST_CNTRL_HOST_RESET_SELECT_Pos (8)                                            /**< (PCR_PWR_RST_CNTRL) Determines what generates the internal platform reset signal. 1=LRESET# pin; 0=eSPI PLTRST# VWire Position */
#define PCR_PWR_RST_CNTRL_HOST_RESET_SELECT_Msk (0x1U << PCR_PWR_RST_CNTRL_HOST_RESET_SELECT_Pos)  /**< (PCR_PWR_RST_CNTRL) Determines what generates the internal platform reset signal. 1=LRESET# pin; 0=eSPI PLTRST# VWire Mask */
#define PCR_PWR_RST_CNTRL_Msk                 (0x00000101UL)                                 /**< (PCR_PWR_RST_CNTRL) Register Mask  */

/* -------- PCR_SYS_RST : (PCR Offset: 0x18) (R/W 32) System Reset Register -------- */

typedef union
{
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t SOFT_SYS_RESET:1;          /**< bit:      8  A write of a 1 forces an assertion of the RESET_SYS reset signal, resetting the device. A write of 0 has no effect. */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_SYS_RST_bits_t;
#define PCR_SYS_RST_RESETVALUE              (0x00U)                                       /**<  (PCR_SYS_RST) System Reset Register  Reset Value */

#define PCR_SYS_RST_SOFT_SYS_RESET_Pos        (8)                                            /**< (PCR_SYS_RST) A write of a 1 forces an assertion of the RESET_SYS reset signal, resetting the device. A write of 0 has no effect. Position */
#define PCR_SYS_RST_SOFT_SYS_RESET_Msk        (0x1U << PCR_SYS_RST_SOFT_SYS_RESET_Pos)       /**< (PCR_SYS_RST) A write of a 1 forces an assertion of the RESET_SYS reset signal, resetting the device. A write of 0 has no effect. Mask */
#define PCR_SYS_RST_Msk                       (0x00000100UL)                                 /**< (PCR_SYS_RST) Register Mask  */

/* -------- PCR_SLP_EN_0 : (PCR Offset: 0x30) (R/W 32) Sleep Enable 0 Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t OTP_SLP_EN:1;              /**< bit:      1  eFuse Enable                                  */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_SLP_EN_0_bits_t;
#define PCR_SLP_EN_0_RESETVALUE             (0x00U)                                       /**<  (PCR_SLP_EN_0) Sleep Enable 0 Register  Reset Value */

#define PCR_SLP_EN_0_OTP_SLP_EN_Pos           (1)                                            /**< (PCR_SLP_EN_0) eFuse Enable Position */
#define PCR_SLP_EN_0_OTP_SLP_EN_Msk           (0x1U << PCR_SLP_EN_0_OTP_SLP_EN_Pos)          /**< (PCR_SLP_EN_0) eFuse Enable Mask */
#define PCR_SLP_EN_0_Msk                      (0x00000002UL)                                 /**< (PCR_SLP_EN_0) Register Mask  */

/* -------- PCR_SLP_EN_1 : (PCR Offset: 0x34) (R/W 32) Sleep Enable 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t INT_SLP_EN:1;              /**< bit:      0  Interrupt Sleep Enable                        */
    uint32_t PECI_SLP_EN:1;             /**< bit:      1  PECI Sleep Enable                             */
    uint32_t TACH0_SLP_EN:1;            /**< bit:      2  TACH0 Sleep Enable (TACH0_SLP_EN)             */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t PWM0_SLP_EN:1;             /**< bit:      4  PWM0 Sleep Enable (PWM0_SLP_EN)               */
    uint32_t PMC_SLP_EN:1;              /**< bit:      5  PMC Sleep Enable (PMC_SLP_EN)                 */
    uint32_t DMA_SLP_EN:1;              /**< bit:      6  DMA Sleep Enable (DMA_SLP_EN)                 */
    uint32_t TFDP_SLP_EN:1;             /**< bit:      7  TFDP Sleep Enable (TFDP_SLP_EN)               */
    uint32_t PROCESSOR_SLP_EN:1;        /**< bit:      8  PROCESSOR Sleep Enable (PROCESSOR_SLP_EN)     */
    uint32_t :1;                        /**< bit:      9  Reserved                                      */
    uint32_t SMB0_SLP_EN:1;             /**< bit:     10  SMB0 Sleep Enable (SMB0_SLP_EN)               */
    uint32_t TACH1_SLP_EN:1;            /**< bit:     11  TACH1 Sleep Enable (TACH1_SLP_EN)             */
    uint32_t TACH2_SLP_EN:1;            /**< bit:     12  TACH2 Sleep Enable (TACH2_SLP_EN)             */
    uint32_t TACH3_SLP_EN:1;            /**< bit:     13  TACH3 Sleep Enable (TACH3_SLP_EN)             */
    uint32_t :6;                        /**< bit: 14..19  Reserved                                      */
    uint32_t PWM1_SLP_EN:1;             /**< bit:     20  PWM1 Sleep Enable (PWM1_SLP_EN)               */
    uint32_t PWM2_SLP_EN:1;             /**< bit:     21  PWM2 Sleep Enable (PWM2_SLP_EN)               */
    uint32_t PWM3_SLP_EN:1;             /**< bit:     22  PWM3 Sleep Enable (PWM3_SLP_EN)               */
    uint32_t PWM4_SLP_EN:1;             /**< bit:     23  PWM4 Sleep Enable (PWM4_SLP_EN)               */
    uint32_t PWM5_SLP_EN:1;             /**< bit:     24  PWM3 Sleep Enable (PWM5_SLP_EN)               */
    uint32_t PWM6_SLP_EN:1;             /**< bit:     25  PWM3 Sleep Enable (PWM6_SLP_EN)               */
    uint32_t PWM7_SLP_EN:1;             /**< bit:     26  PWM3 Sleep Enable (PWM7_SLP_EN)               */
    uint32_t PWM8_SLP_EN:1;             /**< bit:     27  PWM3 Sleep Enable (PWM8_SLP_EN)               */
    uint32_t :1;                        /**< bit:     28  Reserved                                      */
    uint32_t EC_REG_BANK_SLP_EN:1;      /**< bit:     29  EC_REG_BANK Sleep Enable (EC_REG_BANK_SLP_EN) */
    uint32_t TIMER16_0_SLP_EN:1;        /**< bit:     30  TIMER16_0 Sleep Enable (TIMER16_0_SLP_EN)     */
    uint32_t TIMER16_1_SLP_EN:1;        /**< bit:     31  TIMER16_1 Sleep Enable (TIMER16_1_SLP_EN)     */
  };
  uint32_t w;
} __PCR_SLP_EN_1_bits_t;
#define PCR_SLP_EN_1_RESETVALUE             (0x00U)                                       /**<  (PCR_SLP_EN_1) Sleep Enable 1 Register  Reset Value */

