ranjithaguna/pv/LED_Demo/source/pic32cx/component/pcr.h
#define PCR_SLP_EN_1_INT_SLP_EN_Pos           (0)                                            /**< (PCR_SLP_EN_1) Interrupt Sleep Enable Position */
#define PCR_SLP_EN_1_INT_SLP_EN_Msk           (0x1U << PCR_SLP_EN_1_INT_SLP_EN_Pos)          /**< (PCR_SLP_EN_1) Interrupt Sleep Enable Mask */
#define PCR_SLP_EN_1_PECI_SLP_EN_Pos          (1)                                            /**< (PCR_SLP_EN_1) PECI Sleep Enable Position */
#define PCR_SLP_EN_1_PECI_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PECI_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PECI Sleep Enable Mask */
#define PCR_SLP_EN_1_TACH0_SLP_EN_Pos         (2)                                            /**< (PCR_SLP_EN_1) TACH0 Sleep Enable (TACH0_SLP_EN) Position */
#define PCR_SLP_EN_1_TACH0_SLP_EN_Msk         (0x1U << PCR_SLP_EN_1_TACH0_SLP_EN_Pos)        /**< (PCR_SLP_EN_1) TACH0 Sleep Enable (TACH0_SLP_EN) Mask */
#define PCR_SLP_EN_1_PWM0_SLP_EN_Pos          (4)                                            /**< (PCR_SLP_EN_1) PWM0 Sleep Enable (PWM0_SLP_EN) Position */
#define PCR_SLP_EN_1_PWM0_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PWM0_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PWM0 Sleep Enable (PWM0_SLP_EN) Mask */
#define PCR_SLP_EN_1_PMC_SLP_EN_Pos           (5)                                            /**< (PCR_SLP_EN_1) PMC Sleep Enable (PMC_SLP_EN) Position */
#define PCR_SLP_EN_1_PMC_SLP_EN_Msk           (0x1U << PCR_SLP_EN_1_PMC_SLP_EN_Pos)          /**< (PCR_SLP_EN_1) PMC Sleep Enable (PMC_SLP_EN) Mask */
#define PCR_SLP_EN_1_DMA_SLP_EN_Pos           (6)                                            /**< (PCR_SLP_EN_1) DMA Sleep Enable (DMA_SLP_EN) Position */
#define PCR_SLP_EN_1_DMA_SLP_EN_Msk           (0x1U << PCR_SLP_EN_1_DMA_SLP_EN_Pos)          /**< (PCR_SLP_EN_1) DMA Sleep Enable (DMA_SLP_EN) Mask */
#define PCR_SLP_EN_1_TFDP_SLP_EN_Pos          (7)                                            /**< (PCR_SLP_EN_1) TFDP Sleep Enable (TFDP_SLP_EN) Position */
#define PCR_SLP_EN_1_TFDP_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_TFDP_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) TFDP Sleep Enable (TFDP_SLP_EN) Mask */
#define PCR_SLP_EN_1_PROCESSOR_SLP_EN_Pos     (8)                                            /**< (PCR_SLP_EN_1) PROCESSOR Sleep Enable (PROCESSOR_SLP_EN) Position */
#define PCR_SLP_EN_1_PROCESSOR_SLP_EN_Msk     (0x1U << PCR_SLP_EN_1_PROCESSOR_SLP_EN_Pos)    /**< (PCR_SLP_EN_1) PROCESSOR Sleep Enable (PROCESSOR_SLP_EN) Mask */
#define PCR_SLP_EN_1_SMB0_SLP_EN_Pos          (10)                                           /**< (PCR_SLP_EN_1) SMB0 Sleep Enable (SMB0_SLP_EN) Position */
#define PCR_SLP_EN_1_SMB0_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_SMB0_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) SMB0 Sleep Enable (SMB0_SLP_EN) Mask */
#define PCR_SLP_EN_1_TACH1_SLP_EN_Pos         (11)                                           /**< (PCR_SLP_EN_1) TACH1 Sleep Enable (TACH1_SLP_EN) Position */
#define PCR_SLP_EN_1_TACH1_SLP_EN_Msk         (0x1U << PCR_SLP_EN_1_TACH1_SLP_EN_Pos)        /**< (PCR_SLP_EN_1) TACH1 Sleep Enable (TACH1_SLP_EN) Mask */
#define PCR_SLP_EN_1_TACH2_SLP_EN_Pos         (12)                                           /**< (PCR_SLP_EN_1) TACH2 Sleep Enable (TACH2_SLP_EN) Position */
#define PCR_SLP_EN_1_TACH2_SLP_EN_Msk         (0x1U << PCR_SLP_EN_1_TACH2_SLP_EN_Pos)        /**< (PCR_SLP_EN_1) TACH2 Sleep Enable (TACH2_SLP_EN) Mask */
#define PCR_SLP_EN_1_TACH3_SLP_EN_Pos         (13)                                           /**< (PCR_SLP_EN_1) TACH3 Sleep Enable (TACH3_SLP_EN) Position */
#define PCR_SLP_EN_1_TACH3_SLP_EN_Msk         (0x1U << PCR_SLP_EN_1_TACH3_SLP_EN_Pos)        /**< (PCR_SLP_EN_1) TACH3 Sleep Enable (TACH3_SLP_EN) Mask */
#define PCR_SLP_EN_1_PWM1_SLP_EN_Pos          (20)                                           /**< (PCR_SLP_EN_1) PWM1 Sleep Enable (PWM1_SLP_EN) Position */
#define PCR_SLP_EN_1_PWM1_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PWM1_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PWM1 Sleep Enable (PWM1_SLP_EN) Mask */
#define PCR_SLP_EN_1_PWM2_SLP_EN_Pos          (21)                                           /**< (PCR_SLP_EN_1) PWM2 Sleep Enable (PWM2_SLP_EN) Position */
#define PCR_SLP_EN_1_PWM2_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PWM2_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PWM2 Sleep Enable (PWM2_SLP_EN) Mask */
#define PCR_SLP_EN_1_PWM3_SLP_EN_Pos          (22)                                           /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM3_SLP_EN) Position */
#define PCR_SLP_EN_1_PWM3_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PWM3_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM3_SLP_EN) Mask */
#define PCR_SLP_EN_1_PWM4_SLP_EN_Pos          (23)                                           /**< (PCR_SLP_EN_1) PWM4 Sleep Enable (PWM4_SLP_EN) Position */
#define PCR_SLP_EN_1_PWM4_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PWM4_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PWM4 Sleep Enable (PWM4_SLP_EN) Mask */
#define PCR_SLP_EN_1_PWM5_SLP_EN_Pos          (24)                                           /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM5_SLP_EN) Position */
#define PCR_SLP_EN_1_PWM5_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PWM5_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM5_SLP_EN) Mask */
#define PCR_SLP_EN_1_PWM6_SLP_EN_Pos          (25)                                           /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM6_SLP_EN) Position */
#define PCR_SLP_EN_1_PWM6_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PWM6_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM6_SLP_EN) Mask */
#define PCR_SLP_EN_1_PWM7_SLP_EN_Pos          (26)                                           /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM7_SLP_EN) Position */
#define PCR_SLP_EN_1_PWM7_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PWM7_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM7_SLP_EN) Mask */
#define PCR_SLP_EN_1_PWM8_SLP_EN_Pos          (27)                                           /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM8_SLP_EN) Position */
#define PCR_SLP_EN_1_PWM8_SLP_EN_Msk          (0x1U << PCR_SLP_EN_1_PWM8_SLP_EN_Pos)         /**< (PCR_SLP_EN_1) PWM3 Sleep Enable (PWM8_SLP_EN) Mask */
#define PCR_SLP_EN_1_EC_REG_BANK_SLP_EN_Pos   (29)                                           /**< (PCR_SLP_EN_1) EC_REG_BANK Sleep Enable (EC_REG_BANK_SLP_EN) Position */
#define PCR_SLP_EN_1_EC_REG_BANK_SLP_EN_Msk   (0x1U << PCR_SLP_EN_1_EC_REG_BANK_SLP_EN_Pos)  /**< (PCR_SLP_EN_1) EC_REG_BANK Sleep Enable (EC_REG_BANK_SLP_EN) Mask */
#define PCR_SLP_EN_1_TIMER16_0_SLP_EN_Pos     (30)                                           /**< (PCR_SLP_EN_1) TIMER16_0 Sleep Enable (TIMER16_0_SLP_EN) Position */
#define PCR_SLP_EN_1_TIMER16_0_SLP_EN_Msk     (0x1U << PCR_SLP_EN_1_TIMER16_0_SLP_EN_Pos)    /**< (PCR_SLP_EN_1) TIMER16_0 Sleep Enable (TIMER16_0_SLP_EN) Mask */
#define PCR_SLP_EN_1_TIMER16_1_SLP_EN_Pos     (31)                                           /**< (PCR_SLP_EN_1) TIMER16_1 Sleep Enable (TIMER16_1_SLP_EN) Position */
#define PCR_SLP_EN_1_TIMER16_1_SLP_EN_Msk     (0x1U << PCR_SLP_EN_1_TIMER16_1_SLP_EN_Pos)    /**< (PCR_SLP_EN_1) TIMER16_1 Sleep Enable (TIMER16_1_SLP_EN) Mask */
#define PCR_SLP_EN_1_Msk                      (0xEFF03DF7UL)                                 /**< (PCR_SLP_EN_1) Register Mask  */

/* -------- PCR_SLP_EN_2 : (PCR Offset: 0x38) (R/W 32) Sleep Enable 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t UART_0_SLP_EN:1;           /**< bit:      1  UART 0 Sleep Enable                           */
    uint32_t UART_1_SLP_EN:1;           /**< bit:      2  UART 1 Sleep Enable                           */
    uint32_t :16;                       /**< bit:  3..18  Reserved                                      */
    uint32_t ESPI_SLP_EN:1;             /**< bit:     19  eSPI Sleep Enable                             */
    uint32_t :7;                        /**< bit: 20..26  Reserved                                      */
    uint32_t SAF_BRDG_SLP_EN:1;         /**< bit:     27  SAF BRIDGE Sleep Enable                       */
    uint32_t UART_2_SLP_EN:1;           /**< bit:     28  UART 2 Sleep Enable                           */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_SLP_EN_2_bits_t;
#define PCR_SLP_EN_2_RESETVALUE             (0x00U)                                       /**<  (PCR_SLP_EN_2) Sleep Enable 2 Register  Reset Value */

