ranjithaguna/pv/LED_Demo/source/pic32cx/component/pcr.h
#define PCR_SLP_EN_2_UART_0_SLP_EN_Pos        (1)                                            /**< (PCR_SLP_EN_2) UART 0 Sleep Enable Position */
#define PCR_SLP_EN_2_UART_0_SLP_EN_Msk        (0x1U << PCR_SLP_EN_2_UART_0_SLP_EN_Pos)       /**< (PCR_SLP_EN_2) UART 0 Sleep Enable Mask */
#define PCR_SLP_EN_2_UART_1_SLP_EN_Pos        (2)                                            /**< (PCR_SLP_EN_2) UART 1 Sleep Enable Position */
#define PCR_SLP_EN_2_UART_1_SLP_EN_Msk        (0x1U << PCR_SLP_EN_2_UART_1_SLP_EN_Pos)       /**< (PCR_SLP_EN_2) UART 1 Sleep Enable Mask */
#define PCR_SLP_EN_2_ESPI_SLP_EN_Pos          (19)                                           /**< (PCR_SLP_EN_2) eSPI Sleep Enable Position */
#define PCR_SLP_EN_2_ESPI_SLP_EN_Msk          (0x1U << PCR_SLP_EN_2_ESPI_SLP_EN_Pos)         /**< (PCR_SLP_EN_2) eSPI Sleep Enable Mask */
#define PCR_SLP_EN_2_SAF_BRDG_SLP_EN_Pos      (27)                                           /**< (PCR_SLP_EN_2) SAF BRIDGE Sleep Enable Position */
#define PCR_SLP_EN_2_SAF_BRDG_SLP_EN_Msk      (0x1U << PCR_SLP_EN_2_SAF_BRDG_SLP_EN_Pos)     /**< (PCR_SLP_EN_2) SAF BRIDGE Sleep Enable Mask */
#define PCR_SLP_EN_2_UART_2_SLP_EN_Pos        (28)                                           /**< (PCR_SLP_EN_2) UART 2 Sleep Enable Position */
#define PCR_SLP_EN_2_UART_2_SLP_EN_Msk        (0x1U << PCR_SLP_EN_2_UART_2_SLP_EN_Pos)       /**< (PCR_SLP_EN_2) UART 2 Sleep Enable Mask */
#define PCR_SLP_EN_2_Msk                      (0x18080006UL)                                 /**< (PCR_SLP_EN_2) Register Mask  */

/* -------- PCR_SLP_EN_3 : (PCR Offset: 0x3c) (R/W 32) Sleep Enable 3 Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t HDMI_CEC_SLP_EN:1;         /**< bit:      1  HDMI_CEC Sleep Enable (ADC_SLP_EN)            */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t ADC_SLP_EN:1;              /**< bit:      3  ADC Sleep Enable (ADC_SLP_EN)                 */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t PS2_0_SLP_EN:1;            /**< bit:      5  PS2_0 Sleep Enable (PS2_0_SLP_EN)             */
    uint32_t PS2_1_SLP_EN:1;            /**< bit:      6  PS2_1 Sleep Enable (PS2_1_SLP_EN)             */
    uint32_t :3;                        /**< bit:   7..9  Reserved                                      */
    uint32_t HTM_0_SLP_EN:1;            /**< bit:     10  Hibernation Timer 0 Sleep Enable (HTM_0_SLP_EN) */
    uint32_t :2;                        /**< bit: 11..12  Reserved                                      */
    uint32_t SMB1_SLP_EN:1;             /**< bit:     13  SMB1 Sleep Enable (SMB1_SLP_EN)               */
    uint32_t SMB2_SLP_EN:1;             /**< bit:     14  SMB2 Sleep Enable (SMB2_SLP_EN)               */
    uint32_t SMB3_SLP_EN:1;             /**< bit:     15  SMB3 Sleep Enable (SMB3_SLP_EN)               */
    uint32_t LED0_SLP_EN:1;             /**< bit:     16  LED0 Sleep Enable (LED0_SLP_EN)               */
    uint32_t LED1_SLP_EN:1;             /**< bit:     17  LED1 Sleep Enable (LED1_SLP_EN)               */
    uint32_t LED2_SLP_EN:1;             /**< bit:     18  LED2 Sleep Enable (LED2_SLP_EN)               */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t SMB4_SLP_EN:1;             /**< bit:     20  SMB4 Sleep Enable (SMB4_SLP_EN)               */
    uint32_t :2;                        /**< bit: 21..22  Reserved                                      */
    uint32_t TIMER32_0_SLP_EN:1;        /**< bit:     23  TIMER32_0 Sleep Enable (TIMER32_0_SLP_EN)     */
    uint32_t TIMER32_1_SLP_EN:1;        /**< bit:     24  TIMER32_1 Sleep Enable (TIMER32_1_SLP_EN)     */
    uint32_t :1;                        /**< bit:     25  Reserved                                      */
    uint32_t PKE_SLP_EN:1;              /**< bit:     26  PKE Sleep Enable                              */
    uint32_t RNG_SLP_EN:1;              /**< bit:     27  RNG Sleep Enable                              */
    uint32_t AES_HASH_SLP_EN:1;         /**< bit:     28  AES_HASH Sleep Enable                         */
    uint32_t HTM_1_SLP_EN:1;            /**< bit:     29  Hibernation TIMER 1 Sleep Enable (HTM_1_SLP_EN) */
    uint32_t CCTIMER_SLP_EN:1;          /**< bit:     30  Capture Compare Timer Sleep Enable (CCTIMER_SLP_EN) */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __PCR_SLP_EN_3_bits_t;
#define PCR_SLP_EN_3_RESETVALUE             (0x00U)                                       /**<  (PCR_SLP_EN_3) Sleep Enable 3 Register  Reset Value */

#define PCR_SLP_EN_3_HDMI_CEC_SLP_EN_Pos      (1)                                            /**< (PCR_SLP_EN_3) HDMI_CEC Sleep Enable (ADC_SLP_EN) Position */
#define PCR_SLP_EN_3_HDMI_CEC_SLP_EN_Msk      (0x1U << PCR_SLP_EN_3_HDMI_CEC_SLP_EN_Pos)     /**< (PCR_SLP_EN_3) HDMI_CEC Sleep Enable (ADC_SLP_EN) Mask */
#define PCR_SLP_EN_3_ADC_SLP_EN_Pos           (3)                                            /**< (PCR_SLP_EN_3) ADC Sleep Enable (ADC_SLP_EN) Position */
#define PCR_SLP_EN_3_ADC_SLP_EN_Msk           (0x1U << PCR_SLP_EN_3_ADC_SLP_EN_Pos)          /**< (PCR_SLP_EN_3) ADC Sleep Enable (ADC_SLP_EN) Mask */
#define PCR_SLP_EN_3_PS2_0_SLP_EN_Pos         (5)                                            /**< (PCR_SLP_EN_3) PS2_0 Sleep Enable (PS2_0_SLP_EN) Position */
#define PCR_SLP_EN_3_PS2_0_SLP_EN_Msk         (0x1U << PCR_SLP_EN_3_PS2_0_SLP_EN_Pos)        /**< (PCR_SLP_EN_3) PS2_0 Sleep Enable (PS2_0_SLP_EN) Mask */
#define PCR_SLP_EN_3_PS2_1_SLP_EN_Pos         (6)                                            /**< (PCR_SLP_EN_3) PS2_1 Sleep Enable (PS2_1_SLP_EN) Position */
#define PCR_SLP_EN_3_PS2_1_SLP_EN_Msk         (0x1U << PCR_SLP_EN_3_PS2_1_SLP_EN_Pos)        /**< (PCR_SLP_EN_3) PS2_1 Sleep Enable (PS2_1_SLP_EN) Mask */
#define PCR_SLP_EN_3_HTM_0_SLP_EN_Pos         (10)                                           /**< (PCR_SLP_EN_3) Hibernation Timer 0 Sleep Enable (HTM_0_SLP_EN) Position */
#define PCR_SLP_EN_3_HTM_0_SLP_EN_Msk         (0x1U << PCR_SLP_EN_3_HTM_0_SLP_EN_Pos)        /**< (PCR_SLP_EN_3) Hibernation Timer 0 Sleep Enable (HTM_0_SLP_EN) Mask */
#define PCR_SLP_EN_3_SMB1_SLP_EN_Pos          (13)                                           /**< (PCR_SLP_EN_3) SMB1 Sleep Enable (SMB1_SLP_EN) Position */
#define PCR_SLP_EN_3_SMB1_SLP_EN_Msk          (0x1U << PCR_SLP_EN_3_SMB1_SLP_EN_Pos)         /**< (PCR_SLP_EN_3) SMB1 Sleep Enable (SMB1_SLP_EN) Mask */
#define PCR_SLP_EN_3_SMB2_SLP_EN_Pos          (14)                                           /**< (PCR_SLP_EN_3) SMB2 Sleep Enable (SMB2_SLP_EN) Position */
#define PCR_SLP_EN_3_SMB2_SLP_EN_Msk          (0x1U << PCR_SLP_EN_3_SMB2_SLP_EN_Pos)         /**< (PCR_SLP_EN_3) SMB2 Sleep Enable (SMB2_SLP_EN) Mask */
#define PCR_SLP_EN_3_SMB3_SLP_EN_Pos          (15)                                           /**< (PCR_SLP_EN_3) SMB3 Sleep Enable (SMB3_SLP_EN) Position */
#define PCR_SLP_EN_3_SMB3_SLP_EN_Msk          (0x1U << PCR_SLP_EN_3_SMB3_SLP_EN_Pos)         /**< (PCR_SLP_EN_3) SMB3 Sleep Enable (SMB3_SLP_EN) Mask */
#define PCR_SLP_EN_3_LED0_SLP_EN_Pos          (16)                                           /**< (PCR_SLP_EN_3) LED0 Sleep Enable (LED0_SLP_EN) Position */
#define PCR_SLP_EN_3_LED0_SLP_EN_Msk          (0x1U << PCR_SLP_EN_3_LED0_SLP_EN_Pos)         /**< (PCR_SLP_EN_3) LED0 Sleep Enable (LED0_SLP_EN) Mask */
#define PCR_SLP_EN_3_LED1_SLP_EN_Pos          (17)                                           /**< (PCR_SLP_EN_3) LED1 Sleep Enable (LED1_SLP_EN) Position */
#define PCR_SLP_EN_3_LED1_SLP_EN_Msk          (0x1U << PCR_SLP_EN_3_LED1_SLP_EN_Pos)         /**< (PCR_SLP_EN_3) LED1 Sleep Enable (LED1_SLP_EN) Mask */
#define PCR_SLP_EN_3_LED2_SLP_EN_Pos          (18)                                           /**< (PCR_SLP_EN_3) LED2 Sleep Enable (LED2_SLP_EN) Position */
#define PCR_SLP_EN_3_LED2_SLP_EN_Msk          (0x1U << PCR_SLP_EN_3_LED2_SLP_EN_Pos)         /**< (PCR_SLP_EN_3) LED2 Sleep Enable (LED2_SLP_EN) Mask */
#define PCR_SLP_EN_3_SMB4_SLP_EN_Pos          (20)                                           /**< (PCR_SLP_EN_3) SMB4 Sleep Enable (SMB4_SLP_EN) Position */
#define PCR_SLP_EN_3_SMB4_SLP_EN_Msk          (0x1U << PCR_SLP_EN_3_SMB4_SLP_EN_Pos)         /**< (PCR_SLP_EN_3) SMB4 Sleep Enable (SMB4_SLP_EN) Mask */
#define PCR_SLP_EN_3_TIMER32_0_SLP_EN_Pos     (23)                                           /**< (PCR_SLP_EN_3) TIMER32_0 Sleep Enable (TIMER32_0_SLP_EN) Position */
#define PCR_SLP_EN_3_TIMER32_0_SLP_EN_Msk     (0x1U << PCR_SLP_EN_3_TIMER32_0_SLP_EN_Pos)    /**< (PCR_SLP_EN_3) TIMER32_0 Sleep Enable (TIMER32_0_SLP_EN) Mask */
#define PCR_SLP_EN_3_TIMER32_1_SLP_EN_Pos     (24)                                           /**< (PCR_SLP_EN_3) TIMER32_1 Sleep Enable (TIMER32_1_SLP_EN) Position */
#define PCR_SLP_EN_3_TIMER32_1_SLP_EN_Msk     (0x1U << PCR_SLP_EN_3_TIMER32_1_SLP_EN_Pos)    /**< (PCR_SLP_EN_3) TIMER32_1 Sleep Enable (TIMER32_1_SLP_EN) Mask */
#define PCR_SLP_EN_3_PKE_SLP_EN_Pos           (26)                                           /**< (PCR_SLP_EN_3) PKE Sleep Enable Position */
#define PCR_SLP_EN_3_PKE_SLP_EN_Msk           (0x1U << PCR_SLP_EN_3_PKE_SLP_EN_Pos)          /**< (PCR_SLP_EN_3) PKE Sleep Enable Mask */
#define PCR_SLP_EN_3_RNG_SLP_EN_Pos           (27)                                           /**< (PCR_SLP_EN_3) RNG Sleep Enable Position */
#define PCR_SLP_EN_3_RNG_SLP_EN_Msk           (0x1U << PCR_SLP_EN_3_RNG_SLP_EN_Pos)          /**< (PCR_SLP_EN_3) RNG Sleep Enable Mask */
#define PCR_SLP_EN_3_AES_HASH_SLP_EN_Pos      (28)                                           /**< (PCR_SLP_EN_3) AES_HASH Sleep Enable Position */
#define PCR_SLP_EN_3_AES_HASH_SLP_EN_Msk      (0x1U << PCR_SLP_EN_3_AES_HASH_SLP_EN_Pos)     /**< (PCR_SLP_EN_3) AES_HASH Sleep Enable Mask */
#define PCR_SLP_EN_3_HTM_1_SLP_EN_Pos         (29)                                           /**< (PCR_SLP_EN_3) Hibernation TIMER 1 Sleep Enable (HTM_1_SLP_EN) Position */
#define PCR_SLP_EN_3_HTM_1_SLP_EN_Msk         (0x1U << PCR_SLP_EN_3_HTM_1_SLP_EN_Pos)        /**< (PCR_SLP_EN_3) Hibernation TIMER 1 Sleep Enable (HTM_1_SLP_EN) Mask */
#define PCR_SLP_EN_3_CCTIMER_SLP_EN_Pos       (30)                                           /**< (PCR_SLP_EN_3) Capture Compare Timer Sleep Enable (CCTIMER_SLP_EN) Position */
#define PCR_SLP_EN_3_CCTIMER_SLP_EN_Msk       (0x1U << PCR_SLP_EN_3_CCTIMER_SLP_EN_Pos)      /**< (PCR_SLP_EN_3) Capture Compare Timer Sleep Enable (CCTIMER_SLP_EN) Mask */
#define PCR_SLP_EN_3_Msk                      (0x7D97E46AUL)                                 /**< (PCR_SLP_EN_3) Register Mask  */

/* -------- PCR_SLP_EN_4 : (PCR Offset: 0x40) (R/W 32) Sleep Enable 4 Register -------- */

typedef union
{
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t QMSPI_SLP_EN:1;            /**< bit:      8  Quad Master SPI Sleep Enable                  */
    uint32_t :1;                        /**< bit:      9  Reserved                                      */
    uint32_t I2C5_SLP_EN:1;             /**< bit:     10  I2C5 Sleep Enable (I2C5_SLP_EN)               */
    uint32_t I2C6_SLP_EN:1;             /**< bit:     11  I2C6 Sleep Enable (I2C6_SLP_EN)               */
    uint32_t I2C7_SLP_EN:1;             /**< bit:     12  I2C7 Sleep Enable (I2C7_SLP_EN)               */
    uint32_t :4;                        /**< bit: 13..16  Reserved                                      */
    uint32_t SGPIO0_SLP_EN:1;           /**< bit:     17  SGPIO0 Sleep Enable (SGPIO0_SLP_EN)           */
    uint32_t SGPIO1_SLP_EN:1;           /**< bit:     18  SGPIO1 Sleep Enable (SGPIO1_SLP_EN)           */
    uint32_t SGPIO2_SLP_EN:1;           /**< bit:     19  SGPIO2 Sleep Enable (SGPIO2_SLP_EN)           */
    uint32_t SGPIO3_SLP_EN:1;           /**< bit:     20  SGPIO3 Sleep Enable (SGPIO3_SLP_EN)           */
    uint32_t :11;                       /**< bit: 21..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_SLP_EN_4_bits_t;
#define PCR_SLP_EN_4_RESETVALUE             (0x00U)                                       /**<  (PCR_SLP_EN_4) Sleep Enable 4 Register  Reset Value */

#define PCR_SLP_EN_4_QMSPI_SLP_EN_Pos         (8)                                            /**< (PCR_SLP_EN_4) Quad Master SPI Sleep Enable Position */
#define PCR_SLP_EN_4_QMSPI_SLP_EN_Msk         (0x1U << PCR_SLP_EN_4_QMSPI_SLP_EN_Pos)        /**< (PCR_SLP_EN_4) Quad Master SPI Sleep Enable Mask */
#define PCR_SLP_EN_4_I2C5_SLP_EN_Pos          (10)                                           /**< (PCR_SLP_EN_4) I2C5 Sleep Enable (I2C5_SLP_EN) Position */
#define PCR_SLP_EN_4_I2C5_SLP_EN_Msk          (0x1U << PCR_SLP_EN_4_I2C5_SLP_EN_Pos)         /**< (PCR_SLP_EN_4) I2C5 Sleep Enable (I2C5_SLP_EN) Mask */
#define PCR_SLP_EN_4_I2C6_SLP_EN_Pos          (11)                                           /**< (PCR_SLP_EN_4) I2C6 Sleep Enable (I2C6_SLP_EN) Position */
#define PCR_SLP_EN_4_I2C6_SLP_EN_Msk          (0x1U << PCR_SLP_EN_4_I2C6_SLP_EN_Pos)         /**< (PCR_SLP_EN_4) I2C6 Sleep Enable (I2C6_SLP_EN) Mask */
#define PCR_SLP_EN_4_I2C7_SLP_EN_Pos          (12)                                           /**< (PCR_SLP_EN_4) I2C7 Sleep Enable (I2C7_SLP_EN) Position */
#define PCR_SLP_EN_4_I2C7_SLP_EN_Msk          (0x1U << PCR_SLP_EN_4_I2C7_SLP_EN_Pos)         /**< (PCR_SLP_EN_4) I2C7 Sleep Enable (I2C7_SLP_EN) Mask */
#define PCR_SLP_EN_4_SGPIO0_SLP_EN_Pos        (17)                                           /**< (PCR_SLP_EN_4) SGPIO0 Sleep Enable (SGPIO0_SLP_EN) Position */
#define PCR_SLP_EN_4_SGPIO0_SLP_EN_Msk        (0x1U << PCR_SLP_EN_4_SGPIO0_SLP_EN_Pos)       /**< (PCR_SLP_EN_4) SGPIO0 Sleep Enable (SGPIO0_SLP_EN) Mask */
#define PCR_SLP_EN_4_SGPIO1_SLP_EN_Pos        (18)                                           /**< (PCR_SLP_EN_4) SGPIO1 Sleep Enable (SGPIO1_SLP_EN) Position */
#define PCR_SLP_EN_4_SGPIO1_SLP_EN_Msk        (0x1U << PCR_SLP_EN_4_SGPIO1_SLP_EN_Pos)       /**< (PCR_SLP_EN_4) SGPIO1 Sleep Enable (SGPIO1_SLP_EN) Mask */
#define PCR_SLP_EN_4_SGPIO2_SLP_EN_Pos        (19)                                           /**< (PCR_SLP_EN_4) SGPIO2 Sleep Enable (SGPIO2_SLP_EN) Position */
#define PCR_SLP_EN_4_SGPIO2_SLP_EN_Msk        (0x1U << PCR_SLP_EN_4_SGPIO2_SLP_EN_Pos)       /**< (PCR_SLP_EN_4) SGPIO2 Sleep Enable (SGPIO2_SLP_EN) Mask */
#define PCR_SLP_EN_4_SGPIO3_SLP_EN_Pos        (20)                                           /**< (PCR_SLP_EN_4) SGPIO3 Sleep Enable (SGPIO3_SLP_EN) Position */
#define PCR_SLP_EN_4_SGPIO3_SLP_EN_Msk        (0x1U << PCR_SLP_EN_4_SGPIO3_SLP_EN_Pos)       /**< (PCR_SLP_EN_4) SGPIO3 Sleep Enable (SGPIO3_SLP_EN) Mask */
#define PCR_SLP_EN_4_Msk                      (0x001E1D00UL)                                 /**< (PCR_SLP_EN_4) Register Mask  */

