ranjithaguna/pv/LED_Demo/source/pic32cx/component/pcr.h
/* -------- PCR_CLK_REQ_0 : (PCR Offset: 0x50) (R/W 32) Clock Required 0 Register -------- */

typedef union
{
  struct
  {
    uint32_t JTAG_STAP_CLK_REQ:1;       /**< bit:      0  JTAG STAP Enable                              */
    uint32_t OTP_CLK_REQ:1;             /**< bit:      1  eFuse Enable                                  */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_CLK_REQ_0_bits_t;
#define PCR_CLK_REQ_0_RESETVALUE            (0x00U)                                       /**<  (PCR_CLK_REQ_0) Clock Required 0 Register  Reset Value */

#define PCR_CLK_REQ_0_JTAG_STAP_CLK_REQ_Pos   (0)                                            /**< (PCR_CLK_REQ_0) JTAG STAP Enable Position */
#define PCR_CLK_REQ_0_JTAG_STAP_CLK_REQ_Msk   (0x1U << PCR_CLK_REQ_0_JTAG_STAP_CLK_REQ_Pos)  /**< (PCR_CLK_REQ_0) JTAG STAP Enable Mask */
#define PCR_CLK_REQ_0_OTP_CLK_REQ_Pos         (1)                                            /**< (PCR_CLK_REQ_0) eFuse Enable Position */
#define PCR_CLK_REQ_0_OTP_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_0_OTP_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_0) eFuse Enable Mask */
#define PCR_CLK_REQ_0_Msk                     (0x00000003UL)                                 /**< (PCR_CLK_REQ_0) Register Mask  */

/* -------- PCR_CLK_REQ_1 : (PCR Offset: 0x54) (R/W 32) Clock Required 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t INT_CLK_REQ:1;             /**< bit:      0  Interrupt Clock Required                      */
    uint32_t PECI_CLK_REQ:1;            /**< bit:      1  PECI Clock Required                           */
    uint32_t TACH0_CLK_REQ:1;           /**< bit:      2  TACH0 Clock Required (TACH0_CLK_REQ)          */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t PWM0_CLK_REQ:1;            /**< bit:      4  PWM0 Clock Required (PWM0_CLK_REQ)            */
    uint32_t PMC_CLK_REQ:1;             /**< bit:      5  PMC Clock Required (PMC_CLK_REQ)              */
    uint32_t DMA_CLK_REQ:1;             /**< bit:      6  DMA Clock Required (DMA_CLK_REQ)              */
    uint32_t TFDP_CLK_REQ:1;            /**< bit:      7  TFDP Clock Required (TFDP_CLK_REQ)            */
    uint32_t PROCESSOR_CLK_REQ:1;       /**< bit:      8  PROCESSOR Clock Required (PROCESSOR_CLK_REQ)  */
    uint32_t WDT_CLK_REQ:1;             /**< bit:      9  WDT Clock Required (WDT_CLK_REQ)              */
    uint32_t SMB0_CLK_REQ:1;            /**< bit:     10  SMB0 Clock Required (SMB0_CLK_REQ)            */
    uint32_t TACH1_CLK_REQ:1;           /**< bit:     11  TACH1 Clock Required (TACH1_CLK_REQ)          */
    uint32_t TACH2_CLK_REQ:1;           /**< bit:     12  TACH2 Clock Required (TACH2_CLK_REQ)          */
    uint32_t TACH3_CLK_REQ:1;           /**< bit:     13  TACH3 Clock Required (TACH3_CLK_REQ)          */
    uint32_t :6;                        /**< bit: 14..19  Reserved                                      */
    uint32_t PWM1_CLK_REQ:1;            /**< bit:     20  PWM1 Clock Required (PWM1_CLK_REQ)            */
    uint32_t PWM2_CLK_REQ:1;            /**< bit:     21  PWM2 Clock Required (PWM2_CLK_REQ)            */
    uint32_t PWM3_CLK_REQ:1;            /**< bit:     22  PWM3 Clock Required (PWM3_CLK_REQ)            */
    uint32_t PWM4_CLK_REQ:1;            /**< bit:     23  PWM4 Clock Required (PWM4_CLK_REQ)            */
    uint32_t PWM5_CLK_REQ:1;            /**< bit:     24  PWM3 Clock Required (PWM5_CLK_REQ)            */
    uint32_t PWM6_CLK_REQ:1;            /**< bit:     25  PWM3 Clock Required (PWM6_CLK_REQ)            */
    uint32_t PWM7_CLK_REQ:1;            /**< bit:     26  PWM3 Clock Required (PWM7_CLK_REQ)            */
    uint32_t PWM8_CLK_REQ:1;            /**< bit:     27  PWM3 Clock Required (PWM8_CLK_REQ)            */
    uint32_t :1;                        /**< bit:     28  Reserved                                      */
    uint32_t EC_REG_BANK_CLK_REQ:1;     /**< bit:     29  EC_REG_BANK Clock Required (EC_REG_BANK_CLK_REQ) */
    uint32_t TIMER16_0_CLK_REQ:1;       /**< bit:     30  TIMER16_0 Clock Required (TIMER16_0_CLK_REQ)  */
    uint32_t TIMER16_1_CLK_REQ:1;       /**< bit:     31  TIMER16_1 Clock Required (TIMER16_1_CLK_REQ)  */
  };
  uint32_t w;
} __PCR_CLK_REQ_1_bits_t;
#define PCR_CLK_REQ_1_RESETVALUE            (0x00U)                                       /**<  (PCR_CLK_REQ_1) Clock Required 1 Register  Reset Value */

#define PCR_CLK_REQ_1_INT_CLK_REQ_Pos         (0)                                            /**< (PCR_CLK_REQ_1) Interrupt Clock Required Position */
#define PCR_CLK_REQ_1_INT_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_1_INT_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_1) Interrupt Clock Required Mask */
#define PCR_CLK_REQ_1_PECI_CLK_REQ_Pos        (1)                                            /**< (PCR_CLK_REQ_1) PECI Clock Required Position */
#define PCR_CLK_REQ_1_PECI_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PECI_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PECI Clock Required Mask */
#define PCR_CLK_REQ_1_TACH0_CLK_REQ_Pos       (2)                                            /**< (PCR_CLK_REQ_1) TACH0 Clock Required (TACH0_CLK_REQ) Position */
#define PCR_CLK_REQ_1_TACH0_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_1_TACH0_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_1) TACH0 Clock Required (TACH0_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PWM0_CLK_REQ_Pos        (4)                                            /**< (PCR_CLK_REQ_1) PWM0 Clock Required (PWM0_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PWM0_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PWM0_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PWM0 Clock Required (PWM0_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PMC_CLK_REQ_Pos         (5)                                            /**< (PCR_CLK_REQ_1) PMC Clock Required (PMC_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PMC_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_1_PMC_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_1) PMC Clock Required (PMC_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_DMA_CLK_REQ_Pos         (6)                                            /**< (PCR_CLK_REQ_1) DMA Clock Required (DMA_CLK_REQ) Position */
#define PCR_CLK_REQ_1_DMA_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_1_DMA_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_1) DMA Clock Required (DMA_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_TFDP_CLK_REQ_Pos        (7)                                            /**< (PCR_CLK_REQ_1) TFDP Clock Required (TFDP_CLK_REQ) Position */
#define PCR_CLK_REQ_1_TFDP_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_TFDP_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) TFDP Clock Required (TFDP_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PROCESSOR_CLK_REQ_Pos   (8)                                            /**< (PCR_CLK_REQ_1) PROCESSOR Clock Required (PROCESSOR_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PROCESSOR_CLK_REQ_Msk   (0x1U << PCR_CLK_REQ_1_PROCESSOR_CLK_REQ_Pos)  /**< (PCR_CLK_REQ_1) PROCESSOR Clock Required (PROCESSOR_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_WDT_CLK_REQ_Pos         (9)                                            /**< (PCR_CLK_REQ_1) WDT Clock Required (WDT_CLK_REQ) Position */
#define PCR_CLK_REQ_1_WDT_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_1_WDT_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_1) WDT Clock Required (WDT_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_SMB0_CLK_REQ_Pos        (10)                                           /**< (PCR_CLK_REQ_1) SMB0 Clock Required (SMB0_CLK_REQ) Position */
#define PCR_CLK_REQ_1_SMB0_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_SMB0_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) SMB0 Clock Required (SMB0_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_TACH1_CLK_REQ_Pos       (11)                                           /**< (PCR_CLK_REQ_1) TACH1 Clock Required (TACH1_CLK_REQ) Position */
#define PCR_CLK_REQ_1_TACH1_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_1_TACH1_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_1) TACH1 Clock Required (TACH1_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_TACH2_CLK_REQ_Pos       (12)                                           /**< (PCR_CLK_REQ_1) TACH2 Clock Required (TACH2_CLK_REQ) Position */
#define PCR_CLK_REQ_1_TACH2_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_1_TACH2_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_1) TACH2 Clock Required (TACH2_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_TACH3_CLK_REQ_Pos       (13)                                           /**< (PCR_CLK_REQ_1) TACH3 Clock Required (TACH3_CLK_REQ) Position */
#define PCR_CLK_REQ_1_TACH3_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_1_TACH3_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_1) TACH3 Clock Required (TACH3_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PWM1_CLK_REQ_Pos        (20)                                           /**< (PCR_CLK_REQ_1) PWM1 Clock Required (PWM1_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PWM1_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PWM1_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PWM1 Clock Required (PWM1_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PWM2_CLK_REQ_Pos        (21)                                           /**< (PCR_CLK_REQ_1) PWM2 Clock Required (PWM2_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PWM2_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PWM2_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PWM2 Clock Required (PWM2_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PWM3_CLK_REQ_Pos        (22)                                           /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM3_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PWM3_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PWM3_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM3_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PWM4_CLK_REQ_Pos        (23)                                           /**< (PCR_CLK_REQ_1) PWM4 Clock Required (PWM4_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PWM4_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PWM4_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PWM4 Clock Required (PWM4_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PWM5_CLK_REQ_Pos        (24)                                           /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM5_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PWM5_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PWM5_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM5_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PWM6_CLK_REQ_Pos        (25)                                           /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM6_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PWM6_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PWM6_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM6_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PWM7_CLK_REQ_Pos        (26)                                           /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM7_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PWM7_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PWM7_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM7_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_PWM8_CLK_REQ_Pos        (27)                                           /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM8_CLK_REQ) Position */
#define PCR_CLK_REQ_1_PWM8_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_1_PWM8_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_1) PWM3 Clock Required (PWM8_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_EC_REG_BANK_CLK_REQ_Pos (29)                                           /**< (PCR_CLK_REQ_1) EC_REG_BANK Clock Required (EC_REG_BANK_CLK_REQ) Position */
#define PCR_CLK_REQ_1_EC_REG_BANK_CLK_REQ_Msk (0x1U << PCR_CLK_REQ_1_EC_REG_BANK_CLK_REQ_Pos)  /**< (PCR_CLK_REQ_1) EC_REG_BANK Clock Required (EC_REG_BANK_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_TIMER16_0_CLK_REQ_Pos   (30)                                           /**< (PCR_CLK_REQ_1) TIMER16_0 Clock Required (TIMER16_0_CLK_REQ) Position */
#define PCR_CLK_REQ_1_TIMER16_0_CLK_REQ_Msk   (0x1U << PCR_CLK_REQ_1_TIMER16_0_CLK_REQ_Pos)  /**< (PCR_CLK_REQ_1) TIMER16_0 Clock Required (TIMER16_0_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_TIMER16_1_CLK_REQ_Pos   (31)                                           /**< (PCR_CLK_REQ_1) TIMER16_1 Clock Required (TIMER16_1_CLK_REQ) Position */
#define PCR_CLK_REQ_1_TIMER16_1_CLK_REQ_Msk   (0x1U << PCR_CLK_REQ_1_TIMER16_1_CLK_REQ_Pos)  /**< (PCR_CLK_REQ_1) TIMER16_1 Clock Required (TIMER16_1_CLK_REQ) Mask */
#define PCR_CLK_REQ_1_Msk                     (0xEFF03FF7UL)                                 /**< (PCR_CLK_REQ_1) Register Mask  */

/* -------- PCR_CLK_REQ_2 : (PCR Offset: 0x58) (R/W 32) Clock Required 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t IMAP_CLK_REQ:1;            /**< bit:      0  IMAP Clock Required (IMAP_CLK_REQ)            */
    uint32_t UART_0_CLK_REQ:1;          /**< bit:      1  UART 0 Clock Required                         */
    uint32_t UART_1_CLK_REQ:1;          /**< bit:      2  UART 1 Clock Required                         */
    uint32_t :9;                        /**< bit:  3..11  Reserved                                      */
    uint32_t GLBL_CFG_CLK_REQ:1;        /**< bit:     12  GLBL_CFG (GLBL_CFG_CLK_REQ)                   */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t KBCEM_CLK_REQ:1;           /**< bit:     16  8042EM Clock Required (8042EM_CLK_REQ)        */
    uint32_t :1;                        /**< bit:     17  Reserved                                      */
    uint32_t RTC_CLK_REQ:1;             /**< bit:     18  RTC Clock Required (RTC_CLK_REQ)              */
    uint32_t ESPI_CLK_REQ:1;            /**< bit:     19  eSPI Clock Required                           */
    uint32_t :7;                        /**< bit: 20..26  Reserved                                      */
    uint32_t SAF_BRDG_CLK_REQ:1;        /**< bit:     27  SAF BRIDGE Clock Required                     */
    uint32_t UART_2_CLK_REQ:1;          /**< bit:     28  UART 2 Clock Required                         */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_CLK_REQ_2_bits_t;
#define PCR_CLK_REQ_2_RESETVALUE            (0x00U)                                       /**<  (PCR_CLK_REQ_2) Clock Required 2 Register  Reset Value */

#define PCR_CLK_REQ_2_IMAP_CLK_REQ_Pos        (0)                                            /**< (PCR_CLK_REQ_2) IMAP Clock Required (IMAP_CLK_REQ) Position */
#define PCR_CLK_REQ_2_IMAP_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_2_IMAP_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_2) IMAP Clock Required (IMAP_CLK_REQ) Mask */
#define PCR_CLK_REQ_2_UART_0_CLK_REQ_Pos      (1)                                            /**< (PCR_CLK_REQ_2) UART 0 Clock Required Position */
#define PCR_CLK_REQ_2_UART_0_CLK_REQ_Msk      (0x1U << PCR_CLK_REQ_2_UART_0_CLK_REQ_Pos)     /**< (PCR_CLK_REQ_2) UART 0 Clock Required Mask */
#define PCR_CLK_REQ_2_UART_1_CLK_REQ_Pos      (2)                                            /**< (PCR_CLK_REQ_2) UART 1 Clock Required Position */
#define PCR_CLK_REQ_2_UART_1_CLK_REQ_Msk      (0x1U << PCR_CLK_REQ_2_UART_1_CLK_REQ_Pos)     /**< (PCR_CLK_REQ_2) UART 1 Clock Required Mask */
#define PCR_CLK_REQ_2_GLBL_CFG_CLK_REQ_Pos    (12)                                           /**< (PCR_CLK_REQ_2) GLBL_CFG (GLBL_CFG_CLK_REQ) Position */
#define PCR_CLK_REQ_2_GLBL_CFG_CLK_REQ_Msk    (0x1U << PCR_CLK_REQ_2_GLBL_CFG_CLK_REQ_Pos)   /**< (PCR_CLK_REQ_2) GLBL_CFG (GLBL_CFG_CLK_REQ) Mask */
#define PCR_CLK_REQ_2_KBCEM_CLK_REQ_Pos       (16)                                           /**< (PCR_CLK_REQ_2) 8042EM Clock Required (8042EM_CLK_REQ) Position */
#define PCR_CLK_REQ_2_KBCEM_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_2_KBCEM_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_2) 8042EM Clock Required (8042EM_CLK_REQ) Mask */
#define PCR_CLK_REQ_2_RTC_CLK_REQ_Pos         (18)                                           /**< (PCR_CLK_REQ_2) RTC Clock Required (RTC_CLK_REQ) Position */
#define PCR_CLK_REQ_2_RTC_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_2_RTC_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_2) RTC Clock Required (RTC_CLK_REQ) Mask */
#define PCR_CLK_REQ_2_ESPI_CLK_REQ_Pos        (19)                                           /**< (PCR_CLK_REQ_2) eSPI Clock Required Position */
#define PCR_CLK_REQ_2_ESPI_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_2_ESPI_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_2) eSPI Clock Required Mask */
#define PCR_CLK_REQ_2_SAF_BRDG_CLK_REQ_Pos    (27)                                           /**< (PCR_CLK_REQ_2) SAF BRIDGE Clock Required Position */
#define PCR_CLK_REQ_2_SAF_BRDG_CLK_REQ_Msk    (0x1U << PCR_CLK_REQ_2_SAF_BRDG_CLK_REQ_Pos)   /**< (PCR_CLK_REQ_2) SAF BRIDGE Clock Required Mask */
#define PCR_CLK_REQ_2_UART_2_CLK_REQ_Pos      (28)                                           /**< (PCR_CLK_REQ_2) UART 2 Clock Required Position */
#define PCR_CLK_REQ_2_UART_2_CLK_REQ_Msk      (0x1U << PCR_CLK_REQ_2_UART_2_CLK_REQ_Pos)     /**< (PCR_CLK_REQ_2) UART 2 Clock Required Mask */
#define PCR_CLK_REQ_2_Msk                     (0x180D1007UL)                                 /**< (PCR_CLK_REQ_2) Register Mask  */

/* -------- PCR_CLK_REQ_3 : (PCR Offset: 0x5c) (R/W 32) Clock Required 3 Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t HDMI_CEC_CLK_REQ:1;        /**< bit:      1  HDMI_CEC Clock Required (ADC_CLK_REQ)         */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t ADC_CLK_REQ:1;             /**< bit:      3  ADC Clock Required (ADC_CLK_REQ)              */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t PS2_0_CLK_REQ:1;           /**< bit:      5  PS2_0 Clock Required (PS2_0_CLK_REQ)          */
    uint32_t PS2_1_CLK_REQ:1;           /**< bit:      6  PS2_1 Clock Required (PS2_1_CLK_REQ)          */
    uint32_t :3;                        /**< bit:   7..9  Reserved                                      */
    uint32_t HTM_0_CLK_REQ:1;           /**< bit:     10  Hibernation TIMER 0 Clock Required (HTM_0_CLK_REQ) */
    uint32_t KMS_CLK_REQ:1;             /**< bit:     11  KEYSCAN Clock Required (KMS_CLK_REQ)          */
    uint32_t :1;                        /**< bit:     12  Reserved                                      */
    uint32_t SMB1_CLK_REQ:1;            /**< bit:     13  SMB1 Clock Required (SMB1_CLK_REQ)            */
    uint32_t SMB2_CLK_REQ:1;            /**< bit:     14  SMB2 Clock Required (SMB2_CLK_REQ)            */
    uint32_t SMB3_CLK_REQ:1;            /**< bit:     15  SMB3 Clock Required (SMB3_CLK_REQ)            */
    uint32_t LED0_CLK_REQ:1;            /**< bit:     16  LED0 Clock Required (LED0_CLK_REQ)            */
    uint32_t LED1_CLK_REQ:1;            /**< bit:     17  LED1 Clock Required (LED1_CLK_REQ)            */
    uint32_t LED2_CLK_REQ:1;            /**< bit:     18  LED2 Clock Required (LED2_CLK_REQ)            */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t SMB_4_CLK_REQ:1;           /**< bit:     20  SMB 4 Clock Required (SMB_4_CLK_REQ)          */
    uint32_t :2;                        /**< bit: 21..22  Reserved                                      */
    uint32_t TIMER32_0_CLK_REQ:1;       /**< bit:     23  TIMER32_0 Clock Required (TIMER32_0_CLK_REQ)  */
    uint32_t TIMER32_1_CLK_REQ:1;       /**< bit:     24  TIMER32_1 Clock Required (TIMER32_1_CLK_REQ)  */
    uint32_t :1;                        /**< bit:     25  Reserved                                      */
    uint32_t PKE_CLK_REQ:1;             /**< bit:     26  PKE Clock Required                            */
    uint32_t RNG_CLK_REQ:1;             /**< bit:     27  RNG Clock Required                            */
    uint32_t AES_HASH_CLK_REQ:1;        /**< bit:     28  AES_HASH Clock Required                       */
    uint32_t HTM_1_CLK_REQ:1;           /**< bit:     29  Hibernation TIMER 1 Clock Required (HTM_1_CLK_REQ) */
    uint32_t CCTIMER_CLK_REQ:1;         /**< bit:     30  Capture Compare Timer Clock Required (CCTIMER_CLK_REQ) */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __PCR_CLK_REQ_3_bits_t;
#define PCR_CLK_REQ_3_RESETVALUE            (0x00U)                                       /**<  (PCR_CLK_REQ_3) Clock Required 3 Register  Reset Value */

