ranjithaguna/pv/LED_Demo/source/pic32cx/component/pcr.h
#define PCR_CLK_REQ_3_HDMI_CEC_CLK_REQ_Pos    (1)                                            /**< (PCR_CLK_REQ_3) HDMI_CEC Clock Required (ADC_CLK_REQ) Position */
#define PCR_CLK_REQ_3_HDMI_CEC_CLK_REQ_Msk    (0x1U << PCR_CLK_REQ_3_HDMI_CEC_CLK_REQ_Pos)   /**< (PCR_CLK_REQ_3) HDMI_CEC Clock Required (ADC_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_ADC_CLK_REQ_Pos         (3)                                            /**< (PCR_CLK_REQ_3) ADC Clock Required (ADC_CLK_REQ) Position */
#define PCR_CLK_REQ_3_ADC_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_3_ADC_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_3) ADC Clock Required (ADC_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_PS2_0_CLK_REQ_Pos       (5)                                            /**< (PCR_CLK_REQ_3) PS2_0 Clock Required (PS2_0_CLK_REQ) Position */
#define PCR_CLK_REQ_3_PS2_0_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_3_PS2_0_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_3) PS2_0 Clock Required (PS2_0_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_PS2_1_CLK_REQ_Pos       (6)                                            /**< (PCR_CLK_REQ_3) PS2_1 Clock Required (PS2_1_CLK_REQ) Position */
#define PCR_CLK_REQ_3_PS2_1_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_3_PS2_1_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_3) PS2_1 Clock Required (PS2_1_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_HTM_0_CLK_REQ_Pos       (10)                                           /**< (PCR_CLK_REQ_3) Hibernation TIMER 0 Clock Required (HTM_0_CLK_REQ) Position */
#define PCR_CLK_REQ_3_HTM_0_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_3_HTM_0_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_3) Hibernation TIMER 0 Clock Required (HTM_0_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_KMS_CLK_REQ_Pos         (11)                                           /**< (PCR_CLK_REQ_3) KEYSCAN Clock Required (KMS_CLK_REQ) Position */
#define PCR_CLK_REQ_3_KMS_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_3_KMS_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_3) KEYSCAN Clock Required (KMS_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_SMB1_CLK_REQ_Pos        (13)                                           /**< (PCR_CLK_REQ_3) SMB1 Clock Required (SMB1_CLK_REQ) Position */
#define PCR_CLK_REQ_3_SMB1_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_3_SMB1_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_3) SMB1 Clock Required (SMB1_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_SMB2_CLK_REQ_Pos        (14)                                           /**< (PCR_CLK_REQ_3) SMB2 Clock Required (SMB2_CLK_REQ) Position */
#define PCR_CLK_REQ_3_SMB2_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_3_SMB2_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_3) SMB2 Clock Required (SMB2_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_SMB3_CLK_REQ_Pos        (15)                                           /**< (PCR_CLK_REQ_3) SMB3 Clock Required (SMB3_CLK_REQ) Position */
#define PCR_CLK_REQ_3_SMB3_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_3_SMB3_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_3) SMB3 Clock Required (SMB3_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_LED0_CLK_REQ_Pos        (16)                                           /**< (PCR_CLK_REQ_3) LED0 Clock Required (LED0_CLK_REQ) Position */
#define PCR_CLK_REQ_3_LED0_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_3_LED0_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_3) LED0 Clock Required (LED0_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_LED1_CLK_REQ_Pos        (17)                                           /**< (PCR_CLK_REQ_3) LED1 Clock Required (LED1_CLK_REQ) Position */
#define PCR_CLK_REQ_3_LED1_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_3_LED1_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_3) LED1 Clock Required (LED1_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_LED2_CLK_REQ_Pos        (18)                                           /**< (PCR_CLK_REQ_3) LED2 Clock Required (LED2_CLK_REQ) Position */
#define PCR_CLK_REQ_3_LED2_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_3_LED2_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_3) LED2 Clock Required (LED2_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_SMB_4_CLK_REQ_Pos       (20)                                           /**< (PCR_CLK_REQ_3) SMB 4 Clock Required (SMB_4_CLK_REQ) Position */
#define PCR_CLK_REQ_3_SMB_4_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_3_SMB_4_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_3) SMB 4 Clock Required (SMB_4_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_TIMER32_0_CLK_REQ_Pos   (23)                                           /**< (PCR_CLK_REQ_3) TIMER32_0 Clock Required (TIMER32_0_CLK_REQ) Position */
#define PCR_CLK_REQ_3_TIMER32_0_CLK_REQ_Msk   (0x1U << PCR_CLK_REQ_3_TIMER32_0_CLK_REQ_Pos)  /**< (PCR_CLK_REQ_3) TIMER32_0 Clock Required (TIMER32_0_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_TIMER32_1_CLK_REQ_Pos   (24)                                           /**< (PCR_CLK_REQ_3) TIMER32_1 Clock Required (TIMER32_1_CLK_REQ) Position */
#define PCR_CLK_REQ_3_TIMER32_1_CLK_REQ_Msk   (0x1U << PCR_CLK_REQ_3_TIMER32_1_CLK_REQ_Pos)  /**< (PCR_CLK_REQ_3) TIMER32_1 Clock Required (TIMER32_1_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_PKE_CLK_REQ_Pos         (26)                                           /**< (PCR_CLK_REQ_3) PKE Clock Required Position */
#define PCR_CLK_REQ_3_PKE_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_3_PKE_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_3) PKE Clock Required Mask */
#define PCR_CLK_REQ_3_RNG_CLK_REQ_Pos         (27)                                           /**< (PCR_CLK_REQ_3) RNG Clock Required Position */
#define PCR_CLK_REQ_3_RNG_CLK_REQ_Msk         (0x1U << PCR_CLK_REQ_3_RNG_CLK_REQ_Pos)        /**< (PCR_CLK_REQ_3) RNG Clock Required Mask */
#define PCR_CLK_REQ_3_AES_HASH_CLK_REQ_Pos    (28)                                           /**< (PCR_CLK_REQ_3) AES_HASH Clock Required Position */
#define PCR_CLK_REQ_3_AES_HASH_CLK_REQ_Msk    (0x1U << PCR_CLK_REQ_3_AES_HASH_CLK_REQ_Pos)   /**< (PCR_CLK_REQ_3) AES_HASH Clock Required Mask */
#define PCR_CLK_REQ_3_HTM_1_CLK_REQ_Pos       (29)                                           /**< (PCR_CLK_REQ_3) Hibernation TIMER 1 Clock Required (HTM_1_CLK_REQ) Position */
#define PCR_CLK_REQ_3_HTM_1_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_3_HTM_1_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_3) Hibernation TIMER 1 Clock Required (HTM_1_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_CCTIMER_CLK_REQ_Pos     (30)                                           /**< (PCR_CLK_REQ_3) Capture Compare Timer Clock Required (CCTIMER_CLK_REQ) Position */
#define PCR_CLK_REQ_3_CCTIMER_CLK_REQ_Msk     (0x1U << PCR_CLK_REQ_3_CCTIMER_CLK_REQ_Pos)    /**< (PCR_CLK_REQ_3) Capture Compare Timer Clock Required (CCTIMER_CLK_REQ) Mask */
#define PCR_CLK_REQ_3_Msk                     (0x7D97EC6AUL)                                 /**< (PCR_CLK_REQ_3) Register Mask  */

