ranjithaguna/pv/LED_Demo/source/pic32cx/component/pcr.h
/* -------- PCR_CLK_REQ_4 : (PCR Offset: 0x60) (R/W 32) Clock Required 4 Register -------- */

typedef union
{
  struct
  {
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t RTOS_CLK_REQ:1;            /**< bit:      6  RTOS Clock Required (RTOS_CLK_REQ)            */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t QMSPI_CLK_REQ:1;           /**< bit:      8  Quad Master SPI Clock Required                */
    uint32_t :1;                        /**< bit:      9  Reserved                                      */
    uint32_t I2C5_CLK_REQ:1;            /**< bit:     10  I2C5 Clock Required (I2C5_CLK_REQ)            */
    uint32_t I2C6_CLK_REQ:1;            /**< bit:     11  I2C6 Clock Required (I2C6_CLK_REQ)            */
    uint32_t I2C7_CLK_REQ:1;            /**< bit:     12  I2C7 Clock Required (I2C7_CLK_REQ)            */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t SPI_SLAVE_CLK_REQ:1;       /**< bit:     16  SPI SLAVE Clock Required (SPI_SLAVE_CLK_REQ)  */
    uint32_t SGPIO0_CLK_REQ:1;          /**< bit:     17  SGPIO0 Clock Required (SGPIO0_CLK_REQ)        */
    uint32_t SGPIO1_CLK_REQ:1;          /**< bit:     18  SGPIO1 Clock Required (SGPIO1_CLK_REQ)        */
    uint32_t SGPIO2_CLK_REQ:1;          /**< bit:     19  SGPIO2 Clock Required (SGPIO2_CLK_REQ)        */
    uint32_t SGPIO3_CLK_REQ:1;          /**< bit:     20  SGPIO3 Clock Required (SGPIO3_CLK_REQ)        */
    uint32_t :11;                       /**< bit: 21..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_CLK_REQ_4_bits_t;
#define PCR_CLK_REQ_4_RESETVALUE            (0x00U)                                       /**<  (PCR_CLK_REQ_4) Clock Required 4 Register  Reset Value */

#define PCR_CLK_REQ_4_RTOS_CLK_REQ_Pos        (6)                                            /**< (PCR_CLK_REQ_4) RTOS Clock Required (RTOS_CLK_REQ) Position */
#define PCR_CLK_REQ_4_RTOS_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_4_RTOS_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_4) RTOS Clock Required (RTOS_CLK_REQ) Mask */
#define PCR_CLK_REQ_4_QMSPI_CLK_REQ_Pos       (8)                                            /**< (PCR_CLK_REQ_4) Quad Master SPI Clock Required Position */
#define PCR_CLK_REQ_4_QMSPI_CLK_REQ_Msk       (0x1U << PCR_CLK_REQ_4_QMSPI_CLK_REQ_Pos)      /**< (PCR_CLK_REQ_4) Quad Master SPI Clock Required Mask */
#define PCR_CLK_REQ_4_I2C5_CLK_REQ_Pos        (10)                                           /**< (PCR_CLK_REQ_4) I2C5 Clock Required (I2C5_CLK_REQ) Position */
#define PCR_CLK_REQ_4_I2C5_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_4_I2C5_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_4) I2C5 Clock Required (I2C5_CLK_REQ) Mask */
#define PCR_CLK_REQ_4_I2C6_CLK_REQ_Pos        (11)                                           /**< (PCR_CLK_REQ_4) I2C6 Clock Required (I2C6_CLK_REQ) Position */
#define PCR_CLK_REQ_4_I2C6_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_4_I2C6_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_4) I2C6 Clock Required (I2C6_CLK_REQ) Mask */
#define PCR_CLK_REQ_4_I2C7_CLK_REQ_Pos        (12)                                           /**< (PCR_CLK_REQ_4) I2C7 Clock Required (I2C7_CLK_REQ) Position */
#define PCR_CLK_REQ_4_I2C7_CLK_REQ_Msk        (0x1U << PCR_CLK_REQ_4_I2C7_CLK_REQ_Pos)       /**< (PCR_CLK_REQ_4) I2C7 Clock Required (I2C7_CLK_REQ) Mask */
#define PCR_CLK_REQ_4_SPI_SLAVE_CLK_REQ_Pos   (16)                                           /**< (PCR_CLK_REQ_4) SPI SLAVE Clock Required (SPI_SLAVE_CLK_REQ) Position */
#define PCR_CLK_REQ_4_SPI_SLAVE_CLK_REQ_Msk   (0x1U << PCR_CLK_REQ_4_SPI_SLAVE_CLK_REQ_Pos)  /**< (PCR_CLK_REQ_4) SPI SLAVE Clock Required (SPI_SLAVE_CLK_REQ) Mask */
#define PCR_CLK_REQ_4_SGPIO0_CLK_REQ_Pos      (17)                                           /**< (PCR_CLK_REQ_4) SGPIO0 Clock Required (SGPIO0_CLK_REQ) Position */
#define PCR_CLK_REQ_4_SGPIO0_CLK_REQ_Msk      (0x1U << PCR_CLK_REQ_4_SGPIO0_CLK_REQ_Pos)     /**< (PCR_CLK_REQ_4) SGPIO0 Clock Required (SGPIO0_CLK_REQ) Mask */
#define PCR_CLK_REQ_4_SGPIO1_CLK_REQ_Pos      (18)                                           /**< (PCR_CLK_REQ_4) SGPIO1 Clock Required (SGPIO1_CLK_REQ) Position */
#define PCR_CLK_REQ_4_SGPIO1_CLK_REQ_Msk      (0x1U << PCR_CLK_REQ_4_SGPIO1_CLK_REQ_Pos)     /**< (PCR_CLK_REQ_4) SGPIO1 Clock Required (SGPIO1_CLK_REQ) Mask */
#define PCR_CLK_REQ_4_SGPIO2_CLK_REQ_Pos      (19)                                           /**< (PCR_CLK_REQ_4) SGPIO2 Clock Required (SGPIO2_CLK_REQ) Position */
#define PCR_CLK_REQ_4_SGPIO2_CLK_REQ_Msk      (0x1U << PCR_CLK_REQ_4_SGPIO2_CLK_REQ_Pos)     /**< (PCR_CLK_REQ_4) SGPIO2 Clock Required (SGPIO2_CLK_REQ) Mask */
#define PCR_CLK_REQ_4_SGPIO3_CLK_REQ_Pos      (20)                                           /**< (PCR_CLK_REQ_4) SGPIO3 Clock Required (SGPIO3_CLK_REQ) Position */
#define PCR_CLK_REQ_4_SGPIO3_CLK_REQ_Msk      (0x1U << PCR_CLK_REQ_4_SGPIO3_CLK_REQ_Pos)     /**< (PCR_CLK_REQ_4) SGPIO3 Clock Required (SGPIO3_CLK_REQ) Mask */
#define PCR_CLK_REQ_4_Msk                     (0x001F1D40UL)                                 /**< (PCR_CLK_REQ_4) Register Mask  */

/* -------- PCR_RST_EN_0 : (PCR Offset: 0x70) (R/W 32) Reset Enable 0 Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t OTP_RST_EN:1;              /**< bit:      1  eFuse Reset Enable                            */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_RST_EN_0_bits_t;
#define PCR_RST_EN_0_RESETVALUE             (0x00U)                                       /**<  (PCR_RST_EN_0) Reset Enable 0 Register  Reset Value */

#define PCR_RST_EN_0_OTP_RST_EN_Pos           (1)                                            /**< (PCR_RST_EN_0) eFuse Reset Enable Position */
#define PCR_RST_EN_0_OTP_RST_EN_Msk           (0x1U << PCR_RST_EN_0_OTP_RST_EN_Pos)          /**< (PCR_RST_EN_0) eFuse Reset Enable Mask */
#define PCR_RST_EN_0_Msk                      (0x00000002UL)                                 /**< (PCR_RST_EN_0) Register Mask  */

/* -------- PCR_RST_EN_1 : (PCR Offset: 0x74) (R/W 32) Reset Enable 1 Register -------- */

typedef union
{
  struct
  {
    uint32_t INT_RST_EN:1;              /**< bit:      0  Interrupt Reset Enable                        */
    uint32_t PECI_RST_EN:1;             /**< bit:      1  PECI Reset Enable                             */
    uint32_t TACH0_RST_EN:1;            /**< bit:      2  TACH0 Reset Enable (TACH0_RST_EN)             */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t PWM0_RST_EN:1;             /**< bit:      4  PWM0 Reset Enable (PWM0_RST_EN)               */
    uint32_t :1;                        /**< bit:      5  Reserved                                      */
    uint32_t DMA_RST_EN:1;              /**< bit:      6  DMA Reset Enable (DMA_RST_EN)                 */
    uint32_t TFDP_RST_EN:1;             /**< bit:      7  TFDP Reset Enable (TFDP_RST_EN)               */
    uint32_t :1;                        /**< bit:      8  Reserved                                      */
    uint32_t WDT_RST_EN:1;              /**< bit:      9  WDT Reset Enable (WDT_RST_EN)                 */
    uint32_t SMB0_RST_EN:1;             /**< bit:     10  SMB0 Reset Enable (SMB0_RST_EN)               */
    uint32_t TACH1_RST_EN:1;            /**< bit:     11  TACH1 Reset Enable (TACH1_RST_EN)             */
    uint32_t TACH2_RST_EN:1;            /**< bit:     12  TACH2 Reset Enable (TACH2_RST_EN)             */
    uint32_t TACH3_RST_EN:1;            /**< bit:     13  TACH3 Reset Enable (TACH3_RST_EN)             */
    uint32_t :6;                        /**< bit: 14..19  Reserved                                      */
    uint32_t PWM1_RST_EN:1;             /**< bit:     20  PWM1 Reset Enable (PWM1_RST_EN)               */
    uint32_t PWM2_RST_EN:1;             /**< bit:     21  PWM2 Reset Enable (PWM2_RST_EN)               */
    uint32_t PWM3_RST_EN:1;             /**< bit:     22  PWM3 Reset Enable (PWM3_RST_EN)               */
    uint32_t PWM4_RST_EN:1;             /**< bit:     23  PWM4 Reset Enable (PWM4_RST_EN)               */
    uint32_t PWM5_RST_EN:1;             /**< bit:     24  PWM3 Reset Enable (PWM5_RST_EN)               */
    uint32_t PWM6_RST_EN:1;             /**< bit:     25  PWM3 Reset Enable (PWM6_RST_EN)               */
    uint32_t PWM7_RST_EN:1;             /**< bit:     26  PWM3 Reset Enable (PWM7_RST_EN)               */
    uint32_t PWM8_RST_EN:1;             /**< bit:     27  PWM3 Reset Enable (PWM8_RST_EN)               */
    uint32_t :2;                        /**< bit: 28..29  Reserved                                      */
    uint32_t TIMER16_0_RST_EN:1;        /**< bit:     30  TIMER16_0 Reset Enable (TIMER16_0_RST_EN)     */
    uint32_t TIMER16_1_RST_EN:1;        /**< bit:     31  TIMER16_1 Reset Enable (TIMER16_1_RST_EN)     */
  };
  uint32_t w;
} __PCR_RST_EN_1_bits_t;
#define PCR_RST_EN_1_RESETVALUE             (0x00U)                                       /**<  (PCR_RST_EN_1) Reset Enable 1 Register  Reset Value */

#define PCR_RST_EN_1_INT_RST_EN_Pos           (0)                                            /**< (PCR_RST_EN_1) Interrupt Reset Enable Position */
#define PCR_RST_EN_1_INT_RST_EN_Msk           (0x1U << PCR_RST_EN_1_INT_RST_EN_Pos)          /**< (PCR_RST_EN_1) Interrupt Reset Enable Mask */
#define PCR_RST_EN_1_PECI_RST_EN_Pos          (1)                                            /**< (PCR_RST_EN_1) PECI Reset Enable Position */
#define PCR_RST_EN_1_PECI_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PECI_RST_EN_Pos)         /**< (PCR_RST_EN_1) PECI Reset Enable Mask */
#define PCR_RST_EN_1_TACH0_RST_EN_Pos         (2)                                            /**< (PCR_RST_EN_1) TACH0 Reset Enable (TACH0_RST_EN) Position */
#define PCR_RST_EN_1_TACH0_RST_EN_Msk         (0x1U << PCR_RST_EN_1_TACH0_RST_EN_Pos)        /**< (PCR_RST_EN_1) TACH0 Reset Enable (TACH0_RST_EN) Mask */
#define PCR_RST_EN_1_PWM0_RST_EN_Pos          (4)                                            /**< (PCR_RST_EN_1) PWM0 Reset Enable (PWM0_RST_EN) Position */
#define PCR_RST_EN_1_PWM0_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PWM0_RST_EN_Pos)         /**< (PCR_RST_EN_1) PWM0 Reset Enable (PWM0_RST_EN) Mask */
#define PCR_RST_EN_1_DMA_RST_EN_Pos           (6)                                            /**< (PCR_RST_EN_1) DMA Reset Enable (DMA_RST_EN) Position */
#define PCR_RST_EN_1_DMA_RST_EN_Msk           (0x1U << PCR_RST_EN_1_DMA_RST_EN_Pos)          /**< (PCR_RST_EN_1) DMA Reset Enable (DMA_RST_EN) Mask */
#define PCR_RST_EN_1_TFDP_RST_EN_Pos          (7)                                            /**< (PCR_RST_EN_1) TFDP Reset Enable (TFDP_RST_EN) Position */
#define PCR_RST_EN_1_TFDP_RST_EN_Msk          (0x1U << PCR_RST_EN_1_TFDP_RST_EN_Pos)         /**< (PCR_RST_EN_1) TFDP Reset Enable (TFDP_RST_EN) Mask */
#define PCR_RST_EN_1_WDT_RST_EN_Pos           (9)                                            /**< (PCR_RST_EN_1) WDT Reset Enable (WDT_RST_EN) Position */
#define PCR_RST_EN_1_WDT_RST_EN_Msk           (0x1U << PCR_RST_EN_1_WDT_RST_EN_Pos)          /**< (PCR_RST_EN_1) WDT Reset Enable (WDT_RST_EN) Mask */
#define PCR_RST_EN_1_SMB0_RST_EN_Pos          (10)                                           /**< (PCR_RST_EN_1) SMB0 Reset Enable (SMB0_RST_EN) Position */
#define PCR_RST_EN_1_SMB0_RST_EN_Msk          (0x1U << PCR_RST_EN_1_SMB0_RST_EN_Pos)         /**< (PCR_RST_EN_1) SMB0 Reset Enable (SMB0_RST_EN) Mask */
#define PCR_RST_EN_1_TACH1_RST_EN_Pos         (11)                                           /**< (PCR_RST_EN_1) TACH1 Reset Enable (TACH1_RST_EN) Position */
#define PCR_RST_EN_1_TACH1_RST_EN_Msk         (0x1U << PCR_RST_EN_1_TACH1_RST_EN_Pos)        /**< (PCR_RST_EN_1) TACH1 Reset Enable (TACH1_RST_EN) Mask */
#define PCR_RST_EN_1_TACH2_RST_EN_Pos         (12)                                           /**< (PCR_RST_EN_1) TACH2 Reset Enable (TACH2_RST_EN) Position */
#define PCR_RST_EN_1_TACH2_RST_EN_Msk         (0x1U << PCR_RST_EN_1_TACH2_RST_EN_Pos)        /**< (PCR_RST_EN_1) TACH2 Reset Enable (TACH2_RST_EN) Mask */
#define PCR_RST_EN_1_TACH3_RST_EN_Pos         (13)                                           /**< (PCR_RST_EN_1) TACH3 Reset Enable (TACH3_RST_EN) Position */
#define PCR_RST_EN_1_TACH3_RST_EN_Msk         (0x1U << PCR_RST_EN_1_TACH3_RST_EN_Pos)        /**< (PCR_RST_EN_1) TACH3 Reset Enable (TACH3_RST_EN) Mask */
#define PCR_RST_EN_1_PWM1_RST_EN_Pos          (20)                                           /**< (PCR_RST_EN_1) PWM1 Reset Enable (PWM1_RST_EN) Position */
#define PCR_RST_EN_1_PWM1_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PWM1_RST_EN_Pos)         /**< (PCR_RST_EN_1) PWM1 Reset Enable (PWM1_RST_EN) Mask */
#define PCR_RST_EN_1_PWM2_RST_EN_Pos          (21)                                           /**< (PCR_RST_EN_1) PWM2 Reset Enable (PWM2_RST_EN) Position */
#define PCR_RST_EN_1_PWM2_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PWM2_RST_EN_Pos)         /**< (PCR_RST_EN_1) PWM2 Reset Enable (PWM2_RST_EN) Mask */
#define PCR_RST_EN_1_PWM3_RST_EN_Pos          (22)                                           /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM3_RST_EN) Position */
#define PCR_RST_EN_1_PWM3_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PWM3_RST_EN_Pos)         /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM3_RST_EN) Mask */
#define PCR_RST_EN_1_PWM4_RST_EN_Pos          (23)                                           /**< (PCR_RST_EN_1) PWM4 Reset Enable (PWM4_RST_EN) Position */
#define PCR_RST_EN_1_PWM4_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PWM4_RST_EN_Pos)         /**< (PCR_RST_EN_1) PWM4 Reset Enable (PWM4_RST_EN) Mask */
#define PCR_RST_EN_1_PWM5_RST_EN_Pos          (24)                                           /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM5_RST_EN) Position */
#define PCR_RST_EN_1_PWM5_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PWM5_RST_EN_Pos)         /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM5_RST_EN) Mask */
#define PCR_RST_EN_1_PWM6_RST_EN_Pos          (25)                                           /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM6_RST_EN) Position */
#define PCR_RST_EN_1_PWM6_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PWM6_RST_EN_Pos)         /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM6_RST_EN) Mask */
#define PCR_RST_EN_1_PWM7_RST_EN_Pos          (26)                                           /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM7_RST_EN) Position */
#define PCR_RST_EN_1_PWM7_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PWM7_RST_EN_Pos)         /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM7_RST_EN) Mask */
#define PCR_RST_EN_1_PWM8_RST_EN_Pos          (27)                                           /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM8_RST_EN) Position */
#define PCR_RST_EN_1_PWM8_RST_EN_Msk          (0x1U << PCR_RST_EN_1_PWM8_RST_EN_Pos)         /**< (PCR_RST_EN_1) PWM3 Reset Enable (PWM8_RST_EN) Mask */
#define PCR_RST_EN_1_TIMER16_0_RST_EN_Pos     (30)                                           /**< (PCR_RST_EN_1) TIMER16_0 Reset Enable (TIMER16_0_RST_EN) Position */
#define PCR_RST_EN_1_TIMER16_0_RST_EN_Msk     (0x1U << PCR_RST_EN_1_TIMER16_0_RST_EN_Pos)    /**< (PCR_RST_EN_1) TIMER16_0 Reset Enable (TIMER16_0_RST_EN) Mask */
#define PCR_RST_EN_1_TIMER16_1_RST_EN_Pos     (31)                                           /**< (PCR_RST_EN_1) TIMER16_1 Reset Enable (TIMER16_1_RST_EN) Position */
#define PCR_RST_EN_1_TIMER16_1_RST_EN_Msk     (0x1U << PCR_RST_EN_1_TIMER16_1_RST_EN_Pos)    /**< (PCR_RST_EN_1) TIMER16_1 Reset Enable (TIMER16_1_RST_EN) Mask */
#define PCR_RST_EN_1_Msk                      (0xCFF03ED7UL)                                 /**< (PCR_RST_EN_1) Register Mask  */

/* -------- PCR_RST_EN_2 : (PCR Offset: 0x78) (R/W 32) Reset Enable 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t IMAP_RST_EN:1;             /**< bit:      0  IMAP Reset Enable (IMAP_RST_EN)               */
    uint32_t UART_0_RST_EN:1;           /**< bit:      1  UART 0 Reset Enable                           */
    uint32_t UART_1_RST_EN:1;           /**< bit:      2  UART 1 Reset Enable                           */
    uint32_t :10;                       /**< bit:  3..12  Reserved                                      */
    uint32_t ACPI_EC_0_RST_EN:1;        /**< bit:     13  ACPI EC 0 Reset Enable (ACPI_EC_0_RST_EN)     */
    uint32_t ACPI_EC_1_RST_EN:1;        /**< bit:     14  ACPI EC 1 Reset Enable (ACPI_EC_1_RST_EN)     */
    uint32_t ACPI_PM1_RST_EN:1;         /**< bit:     15  ACPI PM1 Reset Enable (ACPI_PM1_RST_EN)       */
    uint32_t KBCEM_RST_EN:1;            /**< bit:     16  8042EM Reset Enable (8042EM_RST_EN)           */
    uint32_t MBX_RST_EN:1;              /**< bit:     17  Mailbox Reset Enable (MBX_RST_EN)             */
    uint32_t RTC_RST_EN:1;              /**< bit:     18  RTC Reset Enable (RTC_RST_EN)                 */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t SCRATCH_32_RST_EN:1;       /**< bit:     20  SCRATCH 32 Reset Enable                       */
    uint32_t ACPI_EC_2_RST_EN:1;        /**< bit:     21  ACPI EC 2 Reset Enable (ACPI_EC_2_RST_EN)     */
    uint32_t ACPI_EC_3_RST_EN:1;        /**< bit:     22  ACPI EC 3 Reset Enable (ACPI_EC_3_RST_EN)     */
    uint32_t :2;                        /**< bit: 23..24  Reserved                                      */
    uint32_t PORT_80_0_RST_EN:1;        /**< bit:     25  Port 80 0 Reset Enable                        */
    uint32_t PORT_80_1_RST_EN:1;        /**< bit:     26  Port 80 1 Reset Enable                        */
    uint32_t :1;                        /**< bit:     27  Reserved                                      */
    uint32_t UART_2_RST_EN:1;           /**< bit:     28  UART 2 Reset Enable                           */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_RST_EN_2_bits_t;
#define PCR_RST_EN_2_RESETVALUE             (0x00U)                                       /**<  (PCR_RST_EN_2) Reset Enable 2 Register  Reset Value */

#define PCR_RST_EN_2_IMAP_RST_EN_Pos          (0)                                            /**< (PCR_RST_EN_2) IMAP Reset Enable (IMAP_RST_EN) Position */
#define PCR_RST_EN_2_IMAP_RST_EN_Msk          (0x1U << PCR_RST_EN_2_IMAP_RST_EN_Pos)         /**< (PCR_RST_EN_2) IMAP Reset Enable (IMAP_RST_EN) Mask */
#define PCR_RST_EN_2_UART_0_RST_EN_Pos        (1)                                            /**< (PCR_RST_EN_2) UART 0 Reset Enable Position */
#define PCR_RST_EN_2_UART_0_RST_EN_Msk        (0x1U << PCR_RST_EN_2_UART_0_RST_EN_Pos)       /**< (PCR_RST_EN_2) UART 0 Reset Enable Mask */
#define PCR_RST_EN_2_UART_1_RST_EN_Pos        (2)                                            /**< (PCR_RST_EN_2) UART 1 Reset Enable Position */
#define PCR_RST_EN_2_UART_1_RST_EN_Msk        (0x1U << PCR_RST_EN_2_UART_1_RST_EN_Pos)       /**< (PCR_RST_EN_2) UART 1 Reset Enable Mask */
#define PCR_RST_EN_2_ACPI_EC_0_RST_EN_Pos     (13)                                           /**< (PCR_RST_EN_2) ACPI EC 0 Reset Enable (ACPI_EC_0_RST_EN) Position */
#define PCR_RST_EN_2_ACPI_EC_0_RST_EN_Msk     (0x1U << PCR_RST_EN_2_ACPI_EC_0_RST_EN_Pos)    /**< (PCR_RST_EN_2) ACPI EC 0 Reset Enable (ACPI_EC_0_RST_EN) Mask */
#define PCR_RST_EN_2_ACPI_EC_1_RST_EN_Pos     (14)                                           /**< (PCR_RST_EN_2) ACPI EC 1 Reset Enable (ACPI_EC_1_RST_EN) Position */
#define PCR_RST_EN_2_ACPI_EC_1_RST_EN_Msk     (0x1U << PCR_RST_EN_2_ACPI_EC_1_RST_EN_Pos)    /**< (PCR_RST_EN_2) ACPI EC 1 Reset Enable (ACPI_EC_1_RST_EN) Mask */
#define PCR_RST_EN_2_ACPI_PM1_RST_EN_Pos      (15)                                           /**< (PCR_RST_EN_2) ACPI PM1 Reset Enable (ACPI_PM1_RST_EN) Position */
#define PCR_RST_EN_2_ACPI_PM1_RST_EN_Msk      (0x1U << PCR_RST_EN_2_ACPI_PM1_RST_EN_Pos)     /**< (PCR_RST_EN_2) ACPI PM1 Reset Enable (ACPI_PM1_RST_EN) Mask */
#define PCR_RST_EN_2_KBCEM_RST_EN_Pos         (16)                                           /**< (PCR_RST_EN_2) 8042EM Reset Enable (8042EM_RST_EN) Position */
#define PCR_RST_EN_2_KBCEM_RST_EN_Msk         (0x1U << PCR_RST_EN_2_KBCEM_RST_EN_Pos)        /**< (PCR_RST_EN_2) 8042EM Reset Enable (8042EM_RST_EN) Mask */
#define PCR_RST_EN_2_MBX_RST_EN_Pos           (17)                                           /**< (PCR_RST_EN_2) Mailbox Reset Enable (MBX_RST_EN) Position */
#define PCR_RST_EN_2_MBX_RST_EN_Msk           (0x1U << PCR_RST_EN_2_MBX_RST_EN_Pos)          /**< (PCR_RST_EN_2) Mailbox Reset Enable (MBX_RST_EN) Mask */
#define PCR_RST_EN_2_RTC_RST_EN_Pos           (18)                                           /**< (PCR_RST_EN_2) RTC Reset Enable (RTC_RST_EN) Position */
#define PCR_RST_EN_2_RTC_RST_EN_Msk           (0x1U << PCR_RST_EN_2_RTC_RST_EN_Pos)          /**< (PCR_RST_EN_2) RTC Reset Enable (RTC_RST_EN) Mask */
#define PCR_RST_EN_2_SCRATCH_32_RST_EN_Pos    (20)                                           /**< (PCR_RST_EN_2) SCRATCH 32 Reset Enable Position */
#define PCR_RST_EN_2_SCRATCH_32_RST_EN_Msk    (0x1U << PCR_RST_EN_2_SCRATCH_32_RST_EN_Pos)   /**< (PCR_RST_EN_2) SCRATCH 32 Reset Enable Mask */
#define PCR_RST_EN_2_ACPI_EC_2_RST_EN_Pos     (21)                                           /**< (PCR_RST_EN_2) ACPI EC 2 Reset Enable (ACPI_EC_2_RST_EN) Position */
#define PCR_RST_EN_2_ACPI_EC_2_RST_EN_Msk     (0x1U << PCR_RST_EN_2_ACPI_EC_2_RST_EN_Pos)    /**< (PCR_RST_EN_2) ACPI EC 2 Reset Enable (ACPI_EC_2_RST_EN) Mask */
#define PCR_RST_EN_2_ACPI_EC_3_RST_EN_Pos     (22)                                           /**< (PCR_RST_EN_2) ACPI EC 3 Reset Enable (ACPI_EC_3_RST_EN) Position */
#define PCR_RST_EN_2_ACPI_EC_3_RST_EN_Msk     (0x1U << PCR_RST_EN_2_ACPI_EC_3_RST_EN_Pos)    /**< (PCR_RST_EN_2) ACPI EC 3 Reset Enable (ACPI_EC_3_RST_EN) Mask */
#define PCR_RST_EN_2_PORT_80_0_RST_EN_Pos     (25)                                           /**< (PCR_RST_EN_2) Port 80 0 Reset Enable Position */
#define PCR_RST_EN_2_PORT_80_0_RST_EN_Msk     (0x1U << PCR_RST_EN_2_PORT_80_0_RST_EN_Pos)    /**< (PCR_RST_EN_2) Port 80 0 Reset Enable Mask */
#define PCR_RST_EN_2_PORT_80_1_RST_EN_Pos     (26)                                           /**< (PCR_RST_EN_2) Port 80 1 Reset Enable Position */
#define PCR_RST_EN_2_PORT_80_1_RST_EN_Msk     (0x1U << PCR_RST_EN_2_PORT_80_1_RST_EN_Pos)    /**< (PCR_RST_EN_2) Port 80 1 Reset Enable Mask */
#define PCR_RST_EN_2_UART_2_RST_EN_Pos        (28)                                           /**< (PCR_RST_EN_2) UART 2 Reset Enable Position */
#define PCR_RST_EN_2_UART_2_RST_EN_Msk        (0x1U << PCR_RST_EN_2_UART_2_RST_EN_Pos)       /**< (PCR_RST_EN_2) UART 2 Reset Enable Mask */
#define PCR_RST_EN_2_Msk                      (0x1677E007UL)                                 /**< (PCR_RST_EN_2) Register Mask  */

/* -------- PCR_RST_EN_3 : (PCR Offset: 0x7c) (R/W 32) Reset Enable 3 Register -------- */

