ranjithaguna/pv/LED_Demo/source/pic32cx/component/pcr.h
typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t HDMI_CEC_RST_EN:1;         /**< bit:      1  HDMI_CEC Reset Enable (HDMI_CEC_RST_EN)       */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t ADC_RST_EN:1;              /**< bit:      3  ADC Reset Enable (ADC_RST_EN)                 */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t PS2_0_RST_EN:1;            /**< bit:      5  PS2_0 Reset Enable (PS2_0_RST_EN)             */
    uint32_t PS2_1_RST_EN:1;            /**< bit:      6  PS2_1 Reset Enable (PS2_1_RST_EN)             */
    uint32_t :3;                        /**< bit:   7..9  Reserved                                      */
    uint32_t HTM_0_RST_EN:1;            /**< bit:     10  Hibernation TIMER 0 Reset Enable (HTM_0_RST_EN) */
    uint32_t KMS_RST_EN:1;              /**< bit:     11  KEYSCAN Reset Enable (KMS_RST_EN)             */
    uint32_t :1;                        /**< bit:     12  Reserved                                      */
    uint32_t SMB1_RST_EN:1;             /**< bit:     13  SMB1 Reset Enable (SMB1_RST_EN)               */
    uint32_t SMB2_RST_EN:1;             /**< bit:     14  SMB2 Reset Enable (SMB2_RST_EN)               */
    uint32_t SMB3_RST_EN:1;             /**< bit:     15  SMB3 Reset Enable (SMB3_RST_EN)               */
    uint32_t LED0_RST_EN:1;             /**< bit:     16  LED0 Reset Enable (LED0_RST_EN)               */
    uint32_t LED1_RST_EN:1;             /**< bit:     17  LED1 Reset Enable (LED1_RST_EN)               */
    uint32_t LED2_RST_EN:1;             /**< bit:     18  LED2 Reset Enable (LED2_RST_EN)               */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t SMB_4_RST_EN:1;            /**< bit:     20  SMB 4 Reset Enable (SMB_4_RST_EN)             */
    uint32_t :2;                        /**< bit: 21..22  Reserved                                      */
    uint32_t TIMER32_0_RST_EN:1;        /**< bit:     23  TIMER32_0 Reset Enable (TIMER32_0_RST_EN)     */
    uint32_t TIMER32_1_RST_EN:1;        /**< bit:     24  TIMER32_1 Reset Enable (TIMER32_1_RST_EN)     */
    uint32_t :1;                        /**< bit:     25  Reserved                                      */
    uint32_t PKE_RST_EN:1;              /**< bit:     26  PKE Reset Enable                              */
    uint32_t RNG_RST_EN:1;              /**< bit:     27  RNG Reset Enable                              */
    uint32_t AES_HASH_RST_EN:1;         /**< bit:     28  AES_HASH Reset Enable                         */
    uint32_t HTM_1_RST_EN:1;            /**< bit:     29  Hibernation TIMER 1 Reset Enable (HTM_1_RST_EN) */
    uint32_t CCTIMER_RST_EN:1;          /**< bit:     30  Capture Compare Timer Reset Enable (CCTIMER_RST_EN) */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __PCR_RST_EN_3_bits_t;
#define PCR_RST_EN_3_RESETVALUE             (0x00U)                                       /**<  (PCR_RST_EN_3) Reset Enable 3 Register  Reset Value */

#define PCR_RST_EN_3_HDMI_CEC_RST_EN_Pos      (1)                                            /**< (PCR_RST_EN_3) HDMI_CEC Reset Enable (HDMI_CEC_RST_EN) Position */
#define PCR_RST_EN_3_HDMI_CEC_RST_EN_Msk      (0x1U << PCR_RST_EN_3_HDMI_CEC_RST_EN_Pos)     /**< (PCR_RST_EN_3) HDMI_CEC Reset Enable (HDMI_CEC_RST_EN) Mask */
#define PCR_RST_EN_3_ADC_RST_EN_Pos           (3)                                            /**< (PCR_RST_EN_3) ADC Reset Enable (ADC_RST_EN) Position */
#define PCR_RST_EN_3_ADC_RST_EN_Msk           (0x1U << PCR_RST_EN_3_ADC_RST_EN_Pos)          /**< (PCR_RST_EN_3) ADC Reset Enable (ADC_RST_EN) Mask */
#define PCR_RST_EN_3_PS2_0_RST_EN_Pos         (5)                                            /**< (PCR_RST_EN_3) PS2_0 Reset Enable (PS2_0_RST_EN) Position */
#define PCR_RST_EN_3_PS2_0_RST_EN_Msk         (0x1U << PCR_RST_EN_3_PS2_0_RST_EN_Pos)        /**< (PCR_RST_EN_3) PS2_0 Reset Enable (PS2_0_RST_EN) Mask */
#define PCR_RST_EN_3_PS2_1_RST_EN_Pos         (6)                                            /**< (PCR_RST_EN_3) PS2_1 Reset Enable (PS2_1_RST_EN) Position */
#define PCR_RST_EN_3_PS2_1_RST_EN_Msk         (0x1U << PCR_RST_EN_3_PS2_1_RST_EN_Pos)        /**< (PCR_RST_EN_3) PS2_1 Reset Enable (PS2_1_RST_EN) Mask */
#define PCR_RST_EN_3_HTM_0_RST_EN_Pos         (10)                                           /**< (PCR_RST_EN_3) Hibernation TIMER 0 Reset Enable (HTM_0_RST_EN) Position */
#define PCR_RST_EN_3_HTM_0_RST_EN_Msk         (0x1U << PCR_RST_EN_3_HTM_0_RST_EN_Pos)        /**< (PCR_RST_EN_3) Hibernation TIMER 0 Reset Enable (HTM_0_RST_EN) Mask */
#define PCR_RST_EN_3_KMS_RST_EN_Pos           (11)                                           /**< (PCR_RST_EN_3) KEYSCAN Reset Enable (KMS_RST_EN) Position */
#define PCR_RST_EN_3_KMS_RST_EN_Msk           (0x1U << PCR_RST_EN_3_KMS_RST_EN_Pos)          /**< (PCR_RST_EN_3) KEYSCAN Reset Enable (KMS_RST_EN) Mask */
#define PCR_RST_EN_3_SMB1_RST_EN_Pos          (13)                                           /**< (PCR_RST_EN_3) SMB1 Reset Enable (SMB1_RST_EN) Position */
#define PCR_RST_EN_3_SMB1_RST_EN_Msk          (0x1U << PCR_RST_EN_3_SMB1_RST_EN_Pos)         /**< (PCR_RST_EN_3) SMB1 Reset Enable (SMB1_RST_EN) Mask */
#define PCR_RST_EN_3_SMB2_RST_EN_Pos          (14)                                           /**< (PCR_RST_EN_3) SMB2 Reset Enable (SMB2_RST_EN) Position */
#define PCR_RST_EN_3_SMB2_RST_EN_Msk          (0x1U << PCR_RST_EN_3_SMB2_RST_EN_Pos)         /**< (PCR_RST_EN_3) SMB2 Reset Enable (SMB2_RST_EN) Mask */
#define PCR_RST_EN_3_SMB3_RST_EN_Pos          (15)                                           /**< (PCR_RST_EN_3) SMB3 Reset Enable (SMB3_RST_EN) Position */
#define PCR_RST_EN_3_SMB3_RST_EN_Msk          (0x1U << PCR_RST_EN_3_SMB3_RST_EN_Pos)         /**< (PCR_RST_EN_3) SMB3 Reset Enable (SMB3_RST_EN) Mask */
#define PCR_RST_EN_3_LED0_RST_EN_Pos          (16)                                           /**< (PCR_RST_EN_3) LED0 Reset Enable (LED0_RST_EN) Position */
#define PCR_RST_EN_3_LED0_RST_EN_Msk          (0x1U << PCR_RST_EN_3_LED0_RST_EN_Pos)         /**< (PCR_RST_EN_3) LED0 Reset Enable (LED0_RST_EN) Mask */
#define PCR_RST_EN_3_LED1_RST_EN_Pos          (17)                                           /**< (PCR_RST_EN_3) LED1 Reset Enable (LED1_RST_EN) Position */
#define PCR_RST_EN_3_LED1_RST_EN_Msk          (0x1U << PCR_RST_EN_3_LED1_RST_EN_Pos)         /**< (PCR_RST_EN_3) LED1 Reset Enable (LED1_RST_EN) Mask */
#define PCR_RST_EN_3_LED2_RST_EN_Pos          (18)                                           /**< (PCR_RST_EN_3) LED2 Reset Enable (LED2_RST_EN) Position */
#define PCR_RST_EN_3_LED2_RST_EN_Msk          (0x1U << PCR_RST_EN_3_LED2_RST_EN_Pos)         /**< (PCR_RST_EN_3) LED2 Reset Enable (LED2_RST_EN) Mask */
#define PCR_RST_EN_3_SMB_4_RST_EN_Pos         (20)                                           /**< (PCR_RST_EN_3) SMB 4 Reset Enable (SMB_4_RST_EN) Position */
#define PCR_RST_EN_3_SMB_4_RST_EN_Msk         (0x1U << PCR_RST_EN_3_SMB_4_RST_EN_Pos)        /**< (PCR_RST_EN_3) SMB 4 Reset Enable (SMB_4_RST_EN) Mask */
#define PCR_RST_EN_3_TIMER32_0_RST_EN_Pos     (23)                                           /**< (PCR_RST_EN_3) TIMER32_0 Reset Enable (TIMER32_0_RST_EN) Position */
#define PCR_RST_EN_3_TIMER32_0_RST_EN_Msk     (0x1U << PCR_RST_EN_3_TIMER32_0_RST_EN_Pos)    /**< (PCR_RST_EN_3) TIMER32_0 Reset Enable (TIMER32_0_RST_EN) Mask */
#define PCR_RST_EN_3_TIMER32_1_RST_EN_Pos     (24)                                           /**< (PCR_RST_EN_3) TIMER32_1 Reset Enable (TIMER32_1_RST_EN) Position */
#define PCR_RST_EN_3_TIMER32_1_RST_EN_Msk     (0x1U << PCR_RST_EN_3_TIMER32_1_RST_EN_Pos)    /**< (PCR_RST_EN_3) TIMER32_1 Reset Enable (TIMER32_1_RST_EN) Mask */
#define PCR_RST_EN_3_PKE_RST_EN_Pos           (26)                                           /**< (PCR_RST_EN_3) PKE Reset Enable Position */
#define PCR_RST_EN_3_PKE_RST_EN_Msk           (0x1U << PCR_RST_EN_3_PKE_RST_EN_Pos)          /**< (PCR_RST_EN_3) PKE Reset Enable Mask */
#define PCR_RST_EN_3_RNG_RST_EN_Pos           (27)                                           /**< (PCR_RST_EN_3) RNG Reset Enable Position */
#define PCR_RST_EN_3_RNG_RST_EN_Msk           (0x1U << PCR_RST_EN_3_RNG_RST_EN_Pos)          /**< (PCR_RST_EN_3) RNG Reset Enable Mask */
#define PCR_RST_EN_3_AES_HASH_RST_EN_Pos      (28)                                           /**< (PCR_RST_EN_3) AES_HASH Reset Enable Position */
#define PCR_RST_EN_3_AES_HASH_RST_EN_Msk      (0x1U << PCR_RST_EN_3_AES_HASH_RST_EN_Pos)     /**< (PCR_RST_EN_3) AES_HASH Reset Enable Mask */
#define PCR_RST_EN_3_HTM_1_RST_EN_Pos         (29)                                           /**< (PCR_RST_EN_3) Hibernation TIMER 1 Reset Enable (HTM_1_RST_EN) Position */
#define PCR_RST_EN_3_HTM_1_RST_EN_Msk         (0x1U << PCR_RST_EN_3_HTM_1_RST_EN_Pos)        /**< (PCR_RST_EN_3) Hibernation TIMER 1 Reset Enable (HTM_1_RST_EN) Mask */
#define PCR_RST_EN_3_CCTIMER_RST_EN_Pos       (30)                                           /**< (PCR_RST_EN_3) Capture Compare Timer Reset Enable (CCTIMER_RST_EN) Position */
#define PCR_RST_EN_3_CCTIMER_RST_EN_Msk       (0x1U << PCR_RST_EN_3_CCTIMER_RST_EN_Pos)      /**< (PCR_RST_EN_3) Capture Compare Timer Reset Enable (CCTIMER_RST_EN) Mask */
#define PCR_RST_EN_3_Msk                      (0x7D97EC6AUL)                                 /**< (PCR_RST_EN_3) Register Mask  */

