ranjithaguna/pv/LED_Demo/source/pic32cx/component/pcr.h
/* -------- PCR_RST_EN_4 : (PCR Offset: 0x80) (R/W 32) Reset Enable 4 Register -------- */

typedef union
{
  struct
  {
    uint32_t :6;                        /**< bit:   0..5  Reserved                                      */
    uint32_t RTOS_RST_EN:1;             /**< bit:      6  RTOS Reset Enable (RTOS_RST_EN)               */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t QMSPI_RST_EN:1;            /**< bit:      8  Quad Master SPI Reset Enable                  */
    uint32_t :1;                        /**< bit:      9  Reserved                                      */
    uint32_t I2C5_RST_EN:1;             /**< bit:     10  I2C5 Reset Enable (I2C5_RST_EN)               */
    uint32_t I2C6_RST_EN:1;             /**< bit:     11  I2C6 Reset Enable (I2C6_RST_EN)               */
    uint32_t I2C7_RST_EN:1;             /**< bit:     12  I2C7 Reset Enable (I2C7_RST_EN)               */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t SPI_SLAVE_RST_EN:1;        /**< bit:     16  SPI SLAVE Reset Enable (SPI_SLAVE_RST_EN)     */
    uint32_t SGPIO0_RST_EN:1;           /**< bit:     17  SGPIO0 Reset Enable (SGPIO0_RST_EN)           */
    uint32_t SGPIO1_RST_EN:1;           /**< bit:     18  SGPIO1 Reset Enable (SGPIO1_RST_EN)           */
    uint32_t SGPIO2_RST_EN:1;           /**< bit:     19  SGPIO2 Reset Enable (SGPIO2_RST_EN)           */
    uint32_t SGPIO3_RST_EN:1;           /**< bit:     20  SGPIO3 Reset Enable (SGPIO3_RST_EN)           */
    uint32_t :11;                       /**< bit: 21..31  Reserved                                      */
  };
  uint32_t w;
} __PCR_RST_EN_4_bits_t;
#define PCR_RST_EN_4_RESETVALUE             (0x00U)                                       /**<  (PCR_RST_EN_4) Reset Enable 4 Register  Reset Value */

#define PCR_RST_EN_4_RTOS_RST_EN_Pos          (6)                                            /**< (PCR_RST_EN_4) RTOS Reset Enable (RTOS_RST_EN) Position */
#define PCR_RST_EN_4_RTOS_RST_EN_Msk          (0x1U << PCR_RST_EN_4_RTOS_RST_EN_Pos)         /**< (PCR_RST_EN_4) RTOS Reset Enable (RTOS_RST_EN) Mask */
#define PCR_RST_EN_4_QMSPI_RST_EN_Pos         (8)                                            /**< (PCR_RST_EN_4) Quad Master SPI Reset Enable Position */
#define PCR_RST_EN_4_QMSPI_RST_EN_Msk         (0x1U << PCR_RST_EN_4_QMSPI_RST_EN_Pos)        /**< (PCR_RST_EN_4) Quad Master SPI Reset Enable Mask */
#define PCR_RST_EN_4_I2C5_RST_EN_Pos          (10)                                           /**< (PCR_RST_EN_4) I2C5 Reset Enable (I2C5_RST_EN) Position */
#define PCR_RST_EN_4_I2C5_RST_EN_Msk          (0x1U << PCR_RST_EN_4_I2C5_RST_EN_Pos)         /**< (PCR_RST_EN_4) I2C5 Reset Enable (I2C5_RST_EN) Mask */
#define PCR_RST_EN_4_I2C6_RST_EN_Pos          (11)                                           /**< (PCR_RST_EN_4) I2C6 Reset Enable (I2C6_RST_EN) Position */
#define PCR_RST_EN_4_I2C6_RST_EN_Msk          (0x1U << PCR_RST_EN_4_I2C6_RST_EN_Pos)         /**< (PCR_RST_EN_4) I2C6 Reset Enable (I2C6_RST_EN) Mask */
#define PCR_RST_EN_4_I2C7_RST_EN_Pos          (12)                                           /**< (PCR_RST_EN_4) I2C7 Reset Enable (I2C7_RST_EN) Position */
#define PCR_RST_EN_4_I2C7_RST_EN_Msk          (0x1U << PCR_RST_EN_4_I2C7_RST_EN_Pos)         /**< (PCR_RST_EN_4) I2C7 Reset Enable (I2C7_RST_EN) Mask */
#define PCR_RST_EN_4_SPI_SLAVE_RST_EN_Pos     (16)                                           /**< (PCR_RST_EN_4) SPI SLAVE Reset Enable (SPI_SLAVE_RST_EN) Position */
#define PCR_RST_EN_4_SPI_SLAVE_RST_EN_Msk     (0x1U << PCR_RST_EN_4_SPI_SLAVE_RST_EN_Pos)    /**< (PCR_RST_EN_4) SPI SLAVE Reset Enable (SPI_SLAVE_RST_EN) Mask */
#define PCR_RST_EN_4_SGPIO0_RST_EN_Pos        (17)                                           /**< (PCR_RST_EN_4) SGPIO0 Reset Enable (SGPIO0_RST_EN) Position */
#define PCR_RST_EN_4_SGPIO0_RST_EN_Msk        (0x1U << PCR_RST_EN_4_SGPIO0_RST_EN_Pos)       /**< (PCR_RST_EN_4) SGPIO0 Reset Enable (SGPIO0_RST_EN) Mask */
#define PCR_RST_EN_4_SGPIO1_RST_EN_Pos        (18)                                           /**< (PCR_RST_EN_4) SGPIO1 Reset Enable (SGPIO1_RST_EN) Position */
#define PCR_RST_EN_4_SGPIO1_RST_EN_Msk        (0x1U << PCR_RST_EN_4_SGPIO1_RST_EN_Pos)       /**< (PCR_RST_EN_4) SGPIO1 Reset Enable (SGPIO1_RST_EN) Mask */
#define PCR_RST_EN_4_SGPIO2_RST_EN_Pos        (19)                                           /**< (PCR_RST_EN_4) SGPIO2 Reset Enable (SGPIO2_RST_EN) Position */
#define PCR_RST_EN_4_SGPIO2_RST_EN_Msk        (0x1U << PCR_RST_EN_4_SGPIO2_RST_EN_Pos)       /**< (PCR_RST_EN_4) SGPIO2 Reset Enable (SGPIO2_RST_EN) Mask */
#define PCR_RST_EN_4_SGPIO3_RST_EN_Pos        (20)                                           /**< (PCR_RST_EN_4) SGPIO3 Reset Enable (SGPIO3_RST_EN) Position */
#define PCR_RST_EN_4_SGPIO3_RST_EN_Msk        (0x1U << PCR_RST_EN_4_SGPIO3_RST_EN_Pos)       /**< (PCR_RST_EN_4) SGPIO3 Reset Enable (SGPIO3_RST_EN) Mask */
#define PCR_RST_EN_4_Msk                      (0x001F1D40UL)                                 /**< (PCR_RST_EN_4) Register Mask  */

/* -------- PCR_LOCK_REG : (PCR Offset: 0x84) (R/W 32) LOCK Register -------- */

typedef union
{
  struct
  {
    uint32_t PCR_RST_EN_LOCK:32;        /**< bit:  0..31  PCR Reset Enable Lock Register.               */
  };
  uint32_t w;
} __PCR_LOCK_REG_bits_t;
#define PCR_LOCK_REG_RESETVALUE             (0xA6382D4DU)                                 /**<  (PCR_LOCK_REG) LOCK Register  Reset Value */

#define PCR_LOCK_REG_PCR_RST_EN_LOCK_Pos      (0)                                            /**< (PCR_LOCK_REG) PCR Reset Enable Lock Register. Position */
#define PCR_LOCK_REG_PCR_RST_EN_LOCK_Msk      (0xFFFFFFFFU << PCR_LOCK_REG_PCR_RST_EN_LOCK_Pos)  /**< (PCR_LOCK_REG) PCR Reset Enable Lock Register. Mask */
#define PCR_LOCK_REG_PCR_RST_EN_LOCK(value)   (PCR_LOCK_REG_PCR_RST_EN_LOCK_Msk & ((value) << PCR_LOCK_REG_PCR_RST_EN_LOCK_Pos))
#define PCR_LOCK_REG_Msk                      (0xFFFFFFFFUL)                                 /**< (PCR_LOCK_REG) Register Mask  */

/** \brief PCR register offsets definitions */
#define PCR_SYS_SLP_CNTRL_OFFSET     (0x00)         /**< (PCR_SYS_SLP_CNTRL) System Sleep Control Offset */
#define PCR_PROC_CLK_CNTRL_OFFSET    (0x04)         /**< (PCR_PROC_CLK_CNTRL) Processor Clock Control Register [7:0] Processor Clock Divide Value (PROC_DIV)\n            1: divide 48 MHz Ring Oscillator by 1.\n            3: divide 48 MHz Ring Oscillator by 3.\n            4: divide 48 MHz Ring Oscillator by 4.\n            16: divide 48 MHz Ring Oscillator by 16.\n            48: divide 48 MHz Ring Oscillator by 48.\n            No other values are supported. Offset */
#define PCR_SLOW_CLK_CNTRL_OFFSET    (0x08)         /**< (PCR_SLOW_CLK_CNTRL) Configures the EC_CLK clock domain Offset */
#define PCR_OSC_ID_OFFSET            (0x0C)         /**< (PCR_OSC_ID) Oscillator ID Register Offset */
#define PCR_PWR_RST_STS_OFFSET       (0x10)         /**< (PCR_PWR_RST_STS) PCR Power Reset Status Register Offset */
#define PCR_PWR_RST_CNTRL_OFFSET     (0x14)         /**< (PCR_PWR_RST_CNTRL) Power Reset Control Register Offset */
#define PCR_SYS_RST_OFFSET           (0x18)         /**< (PCR_SYS_RST) System Reset Register Offset */
#define PCR_SLP_EN_0_OFFSET          (0x30)         /**< (PCR_SLP_EN_0) Sleep Enable 0 Register Offset */
#define PCR_SLP_EN_1_OFFSET          (0x34)         /**< (PCR_SLP_EN_1) Sleep Enable 1 Register Offset */
#define PCR_SLP_EN_2_OFFSET          (0x38)         /**< (PCR_SLP_EN_2) Sleep Enable 2 Register Offset */
#define PCR_SLP_EN_3_OFFSET          (0x3C)         /**< (PCR_SLP_EN_3) Sleep Enable 3 Register Offset */
#define PCR_SLP_EN_4_OFFSET          (0x40)         /**< (PCR_SLP_EN_4) Sleep Enable 4 Register Offset */
#define PCR_CLK_REQ_0_OFFSET         (0x50)         /**< (PCR_CLK_REQ_0) Clock Required 0 Register Offset */
#define PCR_CLK_REQ_1_OFFSET         (0x54)         /**< (PCR_CLK_REQ_1) Clock Required 1 Register Offset */
#define PCR_CLK_REQ_2_OFFSET         (0x58)         /**< (PCR_CLK_REQ_2) Clock Required 2 Register Offset */
#define PCR_CLK_REQ_3_OFFSET         (0x5C)         /**< (PCR_CLK_REQ_3) Clock Required 3 Register Offset */
#define PCR_CLK_REQ_4_OFFSET         (0x60)         /**< (PCR_CLK_REQ_4) Clock Required 4 Register Offset */
#define PCR_RST_EN_0_OFFSET          (0x70)         /**< (PCR_RST_EN_0) Reset Enable 0 Register Offset */
#define PCR_RST_EN_1_OFFSET          (0x74)         /**< (PCR_RST_EN_1) Reset Enable 1 Register Offset */
#define PCR_RST_EN_2_OFFSET          (0x78)         /**< (PCR_RST_EN_2) Reset Enable 2 Register Offset */
#define PCR_RST_EN_3_OFFSET          (0x7C)         /**< (PCR_RST_EN_3) Reset Enable 3 Register Offset */
#define PCR_RST_EN_4_OFFSET          (0x80)         /**< (PCR_RST_EN_4) Reset Enable 4 Register Offset */
#define PCR_LOCK_REG_OFFSET          (0x84)         /**< (PCR_LOCK_REG) LOCK Register Offset */

/** \brief PCR register API structure */
typedef struct
{  /* The Power, Clocks, and Resets (PCR) Section identifies all the power supplies,\n        clock sources, and reset inputs to the chip and defines all the derived power, clock, and reset signals. */
  __IO  __PCR_SYS_SLP_CNTRL_bits_t     SYS_SLP_CNTRL; /**< Offset: 0x00 (R/W  32) System Sleep Control */
  __IO  __PCR_PROC_CLK_CNTRL_bits_t    PROC_CLK_CNTRL; /**< Offset: 0x04 (R/W  32) Processor Clock Control Register [7:0] Processor Clock Divide Value (PROC_DIV)\n            1: divide 48 MHz Ring Oscillator by 1.\n            3: divide 48 MHz Ring Oscillator by 3.\n            4: divide 48 MHz Ring Oscillator by 4.\n            16: divide 48 MHz Ring Oscillator by 16.\n            48: divide 48 MHz Ring Oscillator by 48.\n            No other values are supported. */
  __IO  __PCR_SLOW_CLK_CNTRL_bits_t    SLOW_CLK_CNTRL; /**< Offset: 0x08 (R/W  32) Configures the EC_CLK clock domain */
  __IO  __PCR_OSC_ID_bits_t            OSC_ID;        /**< Offset: 0x0C (R/W  32) Oscillator ID Register */
  __IO  __PCR_PWR_RST_STS_bits_t       PCR_PWR_RST_STS; /**< Offset: 0x10 (R/W  32) PCR Power Reset Status Register */
  __IO  __PCR_PWR_RST_CNTRL_bits_t     PWR_RST_CNTRL; /**< Offset: 0x14 (R/W  32) Power Reset Control Register */
  __IO  __PCR_SYS_RST_bits_t           SYS_RST;       /**< Offset: 0x18 (R/W  32) System Reset Register */
  __IO  __PCR_SLP_EN_0_bits_t          SLP_EN_0;      /**< Offset: 0x30 (R/W  32) Sleep Enable 0 Register */
  __IO  __PCR_SLP_EN_1_bits_t          SLP_EN_1;      /**< Offset: 0x34 (R/W  32) Sleep Enable 1 Register */
  __IO  __PCR_SLP_EN_2_bits_t          SLP_EN_2;      /**< Offset: 0x38 (R/W  32) Sleep Enable 2 Register */
  __IO  __PCR_SLP_EN_3_bits_t          SLP_EN_3;      /**< Offset: 0x3C (R/W  32) Sleep Enable 3 Register */
  __IO  __PCR_SLP_EN_4_bits_t          SLP_EN_4;      /**< Offset: 0x40 (R/W  32) Sleep Enable 4 Register */
  __IO  __PCR_CLK_REQ_0_bits_t         CLK_REQ_0;     /**< Offset: 0x50 (R/W  32) Clock Required 0 Register */
  __IO  __PCR_CLK_REQ_1_bits_t         CLK_REQ_1;     /**< Offset: 0x54 (R/W  32) Clock Required 1 Register */
  __IO  __PCR_CLK_REQ_2_bits_t         CLK_REQ_2;     /**< Offset: 0x58 (R/W  32) Clock Required 2 Register */
  __IO  __PCR_CLK_REQ_3_bits_t         CLK_REQ_3;     /**< Offset: 0x5C (R/W  32) Clock Required 3 Register */
  __IO  __PCR_CLK_REQ_4_bits_t         CLK_REQ_4;     /**< Offset: 0x60 (R/W  32) Clock Required 4 Register */
  __IO  __PCR_RST_EN_0_bits_t          RST_EN_0;      /**< Offset: 0x70 (R/W  32) Reset Enable 0 Register */
  __IO  __PCR_RST_EN_1_bits_t          RST_EN_1;      /**< Offset: 0x74 (R/W  32) Reset Enable 1 Register */
  __IO  __PCR_RST_EN_2_bits_t          RST_EN_2;      /**< Offset: 0x78 (R/W  32) Reset Enable 2 Register */
  __IO  __PCR_RST_EN_3_bits_t          RST_EN_3;      /**< Offset: 0x7C (R/W  32) Reset Enable 3 Register */
  __IO  __PCR_RST_EN_4_bits_t          RST_EN_4;      /**< Offset: 0x80 (R/W  32) Reset Enable 4 Register */
  __IO  __PCR_LOCK_REG_bits_t          LOCK_REG;      /**< Offset: 0x84 (R/W  32) LOCK Register */
} pcr_registers_t;
/** @}  end of The Power, Clocks, and Resets (PCR) Section identifies all the power supplies,\n        clock sources, and reset inputs to the chip and defines all the derived power, clock, and reset signals. */

#endif /* _PIC32CX_0525SG12_PCR_COMPONENT_H_ */
